[OrderId]  ,
[UserId]  , 客户ID
[BranchCampusBusinessCheckeID] , 分校业务审核状态id
[HeadquartersCampusBusinessCheckeID] , 总校业务审核状态ID
[BranchCampusFinanceCheckeID] , 分校审核状态ID
[HeadquartersCampusFinanceCheckeID] , 总校审核状态ID
[Remarks]  , 备注
[OrderType] , 订单类型
[OrderSource] , 订单来源
[OrderOwningUser] ,  订单所属人
[OrderOwningBusinessUnit] , 订单所属部门
[OrderOwningCompany]  , 订单所属分校
[OrderPayableMoney] , 订单总金额
[OrderActualMoney]  , 订单实付
[CreatedBy] , 创建人
[CreatedOn]  , 创建时间
[ModifiedOn] , 修改时间
[ModifiedBy]   , 修改人
[IsDeleted]   , 是否删除
[IsInvalid]   DEFAULT ((0)) , 是否作废
[OrderNumber] , 订单编号
[NewCheckedId]   , 最新审核状态
[OperationOrderId]   , 老订单ID
[TFWay]  , 退费方式
[IsOld]   DEFAULT ((0)) , 是否老订单
[OtherChargesNote]  , 其它费用备注
[SettlementStatus]  
[ProjectType]  
[OpenState]  
[CustomFlag] 
[CheckType]  
[SynchronizationTime] 
[RefundType] 
[OrderBusinessType] 
[UpdatedOn] 
SELECT DISTINCT d.DDCode from SYS_DD d 
JOIN FC_SalesChargeDetail s on d.DDCode = s.PaymentsType
WHERE d.DDName  in ('安庆-农业-尾号7373','安阳-邮政-尾号1405','安阳-中信-尾号5411','保定-建设-尾号1949','保定-建设-尾号3500','北京-建设-尾号9353','常州-建设-尾号6103','成都-农业-尾号6268','福州-建设-尾号0027','福州-建设-尾号5348','福州-民生-尾号2732','工行汇款-黄森','工商银行-北京-尾号4517','工商银行-焦作-尾号4943','广州-建设-尾号8637','广州-交通-尾号6875','哈尔滨-建设-尾号2054','杭州-杭州-尾号8950','杭州-招商-尾号9653','合肥-交通-尾号5692','合肥-民生-尾号2096','菏泽-建设-尾号7999','衡阳-工商-尾号9013','济南-建设-尾号9838','济南-民生-尾号1122','济南-农行-尾号4603','济南-农业-尾号9637','济宁-中信-尾号9171','焦作-工行-尾号7987','焦作-建设-尾号0362','荆州-农商-尾号7063','开封-农信-尾号2624','六安-建设-尾号2190','洛阳-交通-尾号7925','南昌-中国-尾号6262','南京-中国-尾号8715','南京-中信-尾号6164','南阳-邮政-尾号9931','平顶山-工商-尾号0007','青岛-工行-尾号6830','青岛-工商-尾号1036','全国通用-易宝刷卡-培训学校','上海-建设-尾号9142','上海-民生-尾号4790','上海-农业-尾号1204','上海-中行-尾号1279','沈阳-建行-尾号0532','沈阳-交通-尾号2406','沈阳-盛京-尾号3390','石家庄-民生-尾号0037','石家庄-民生-尾号6129','石家庄-中信-尾号2265','石家庄-中信-尾号4151','苏州-工商-尾号0787','苏州-农行-尾号3024','苏州-农业-尾号0822','太原-民生-尾号8389','天津-中信-尾号1344','天津-中信-尾号3784','潍坊-招商-尾号8418','乌鲁木齐-中行-尾号5249','武汉-建行-尾号1275','武汉-农商-尾号0012','武汉-农业-尾号4678','武汉-兴业-尾号5712','西安-中信-尾号8691','西宁-工商-尾号3407','襄阳-中国-尾号5185','新乡-工商-尾号1324','新乡-建设-尾号6120','徐州-农业-尾号0703','许昌-建设-尾号6281','许昌-中原-尾号6730','阳泉-建设-尾号9026','宜昌-建设-尾号6183','榆林-中信-尾号7009','运城-工商-尾号5962','长春-建行-尾号0641','郑州-建设-尾号5173','郑州-建设-尾号6159','郑州-郑州-尾号5186','重庆-农业-尾号7248','周口-中原-尾号8641','全国通用-易宝刷卡-其它','上海-淘宝','郑州-汇付天下','郑州-工商-尾号3594','全国通用-现金','全国通用-中信卡','全国通用-农商-卓越盈佳','文盛-对公支付宝','环优盛文-客来乐-支付宝','环优-拉卡拉','环优盛文-客来乐-微信','环优-中信-尾号3814','京东-对公支付-北京','环优盛文-客来乐-支付宝','环优-拉卡拉','环优盛文-客来乐-微信','环优-中信-尾号3814','优一点-客来乐-支付宝','优一点-客来乐-微信','优一点-新大陆','优一点-民生-5150','全国通用-现金','全国通用-中信卡','全国通用-农商-卓越盈佳','全国通用-易宝刷卡-培训学校','文盛-对公支付宝','上海-淘宝','京东-对公支付-北京')




------------------------修改后

--系统总订单量 56608
select count(*) from FC_Order 

-- 符合迁移规则的订单量 19164  
select count(*) from FC_Order fc  WITH (NOLOCK)
where not exists (
	select 1
	from FC_Receipt r 
	join   FC_SalesChargeDetail s  on r.ReceiptGuid = s.ReceiptGuid
	join  SYS_DD dd on  s.PaymentsType = dd.DDCode and dd.DDType = 'PaymentsType'
	where r.orderId = fc.orderId
	and dd.DDName in ('安庆-农业-尾号7373','安阳-邮政-尾号1405','安阳-中信-尾号5411','保定-建设-尾号1949','保定-建设-尾号3500','北京-建设-尾号9353','常州-建设-尾号6103','成都-农业-尾号6268','福州-建设-尾号0027','福州-建设-尾号5348','福州-民生-尾号2732','工行汇款-黄森','工商银行-北京-尾号4517','工商银行-焦作-尾号4943','广州-建设-尾号8637','广州-交通-尾号6875','哈尔滨-建设-尾号2054','杭州-杭州-尾号8950','杭州-招商-尾号9653','合肥-交通-尾号5692','合肥-民生-尾号2096','菏泽-建设-尾号7999','衡阳-工商-尾号9013','济南-建设-尾号9838','济南-民生-尾号1122','济南-农行-尾号4603','济南-农业-尾号9637','济宁-中信-尾号9171','焦作-工行-尾号7987','焦作-建设-尾号0362','荆州-农商-尾号7063','开封-农信-尾号2624','六安-建设-尾号2190','洛阳-交通-尾号7925','南昌-中国-尾号6262','南京-中国-尾号8715','南京-中信-尾号6164','南阳-邮政-尾号9931','平顶山-工商-尾号0007','青岛-工行-尾号6830','青岛-工商-尾号1036','全国通用-易宝刷卡-培训学校','上海-建设-尾号9142','上海-民生-尾号4790','上海-农业-尾号1204','上海-中行-尾号1279','沈阳-建行-尾号0532','沈阳-交通-尾号2406','沈阳-盛京-尾号3390','石家庄-民生-尾号0037','石家庄-民生-尾号6129','石家庄-中信-尾号2265','石家庄-中信-尾号4151','苏州-工商-尾号0787','苏州-农行-尾号3024','苏州-农业-尾号0822','太原-民生-尾号8389','天津-中信-尾号1344','天津-中信-尾号3784','潍坊-招商-尾号8418','乌鲁木齐-中行-尾号5249','武汉-建行-尾号1275','武汉-农商-尾号0012','武汉-农业-尾号4678','武汉-兴业-尾号5712','西安-中信-尾号8691','西宁-工商-尾号3407','襄阳-中国-尾号5185','新乡-工商-尾号1324','新乡-建设-尾号6120','徐州-农业-尾号0703','许昌-建设-尾号6281','许昌-中原-尾号6730','阳泉-建设-尾号9026','宜昌-建设-尾号6183','榆林-中信-尾号7009','运城-工商-尾号5962','长春-建行-尾号0641','郑州-建设-尾号5173','郑州-建设-尾号6159','郑州-郑州-尾号5186','重庆-农业-尾号7248','周口-中原-尾号8641','全国通用-易宝刷卡-其它','上海-淘宝','郑州-汇付天下','郑州-工商-尾号3594','全国通用-现金','全国通用-中信卡','全国通用-农商-卓越盈佳','文盛-对公支付宝','环优盛文-客来乐-支付宝','环优-拉卡拉','环优盛文-客来乐-微信','环优-中信-尾号3814','京东-对公支付-北京','环优盛文-客来乐-支付宝','环优-拉卡拉','环优盛文-客来乐-微信','环优-中信-尾号3814','优一点-客来乐-支付宝','优一点-客来乐-微信','优一点-新大陆','优一点-民生-5150','全国通用-现金','全国通用-中信卡','全国通用-农商-卓越盈佳','全国通用-易宝刷卡-培训学校','文盛-对公支付宝','上海-淘宝','京东-对公支付-北京')
)
and fc.OrderType in ('01','02','03','04','05')
and fc.CreatedOn BETWEEN  '2018-01-01 00:00:00.001' and '2020-10-31 23:59:59.999'  

-- 不符合迁移规则的订单量 

    --不在预期时间之内的 28929
select count(fc.OrderId) from FC_Order fc
where  fc.CreatedOn not BETWEEN  '2018-01-01 00:00:00.001' and '2020-10-31 23:59:59.999'  

    -- 有效日期内 不符合指定付款条件的 8248
select count(*) from FC_Order fc  WITH (NOLOCK)
where exists (
	select 1
	from FC_Receipt r 
	join   FC_SalesChargeDetail s  on r.ReceiptGuid = s.ReceiptGuid
	join  SYS_DD dd on  s.PaymentsType = dd.DDCode and dd.DDType = 'PaymentsType'
	where r.orderId = fc.orderId
	and dd.DDName in ('安庆-农业-尾号7373','安阳-邮政-尾号1405','安阳-中信-尾号5411','保定-建设-尾号1949','保定-建设-尾号3500','北京-建设-尾号9353','常州-建设-尾号6103','成都-农业-尾号6268','福州-建设-尾号0027','福州-建设-尾号5348','福州-民生-尾号2732','工行汇款-黄森','工商银行-北京-尾号4517','工商银行-焦作-尾号4943','广州-建设-尾号8637','广州-交通-尾号6875','哈尔滨-建设-尾号2054','杭州-杭州-尾号8950','杭州-招商-尾号9653','合肥-交通-尾号5692','合肥-民生-尾号2096','菏泽-建设-尾号7999','衡阳-工商-尾号9013','济南-建设-尾号9838','济南-民生-尾号1122','济南-农行-尾号4603','济南-农业-尾号9637','济宁-中信-尾号9171','焦作-工行-尾号7987','焦作-建设-尾号0362','荆州-农商-尾号7063','开封-农信-尾号2624','六安-建设-尾号2190','洛阳-交通-尾号7925','南昌-中国-尾号6262','南京-中国-尾号8715','南京-中信-尾号6164','南阳-邮政-尾号9931','平顶山-工商-尾号0007','青岛-工行-尾号6830','青岛-工商-尾号1036','全国通用-易宝刷卡-培训学校','上海-建设-尾号9142','上海-民生-尾号4790','上海-农业-尾号1204','上海-中行-尾号1279','沈阳-建行-尾号0532','沈阳-交通-尾号2406','沈阳-盛京-尾号3390','石家庄-民生-尾号0037','石家庄-民生-尾号6129','石家庄-中信-尾号2265','石家庄-中信-尾号4151','苏州-工商-尾号0787','苏州-农行-尾号3024','苏州-农业-尾号0822','太原-民生-尾号8389','天津-中信-尾号1344','天津-中信-尾号3784','潍坊-招商-尾号8418','乌鲁木齐-中行-尾号5249','武汉-建行-尾号1275','武汉-农商-尾号0012','武汉-农业-尾号4678','武汉-兴业-尾号5712','西安-中信-尾号8691','西宁-工商-尾号3407','襄阳-中国-尾号5185','新乡-工商-尾号1324','新乡-建设-尾号6120','徐州-农业-尾号0703','许昌-建设-尾号6281','许昌-中原-尾号6730','阳泉-建设-尾号9026','宜昌-建设-尾号6183','榆林-中信-尾号7009','运城-工商-尾号5962','长春-建行-尾号0641','郑州-建设-尾号5173','郑州-建设-尾号6159','郑州-郑州-尾号5186','重庆-农业-尾号7248','周口-中原-尾号8641','全国通用-易宝刷卡-其它','上海-淘宝','郑州-汇付天下','郑州-工商-尾号3594','全国通用-现金','全国通用-中信卡','全国通用-农商-卓越盈佳','文盛-对公支付宝','环优盛文-客来乐-支付宝','环优-拉卡拉','环优盛文-客来乐-微信','环优-中信-尾号3814','京东-对公支付-北京','环优盛文-客来乐-支付宝','环优-拉卡拉','环优盛文-客来乐-微信','环优-中信-尾号3814','优一点-客来乐-支付宝','优一点-客来乐-微信','优一点-新大陆','优一点-民生-5150','全国通用-现金','全国通用-中信卡','全国通用-农商-卓越盈佳','全国通用-易宝刷卡-培训学校','文盛-对公支付宝','上海-淘宝','京东-对公支付-北京')
)
and fc.CreatedOn BETWEEN  '2018-01-01 00:00:00.001' and '2020-10-31 23:59:59.999' 

    -- 符合迁移规则的订单量,不符合迁移订单类型的  264
select count(*) from FC_Order fc  WITH (NOLOCK)
where not exists (
	select 1
	from FC_Receipt r 
	join   FC_SalesChargeDetail s  on r.ReceiptGuid = s.ReceiptGuid
	join  SYS_DD dd on  s.PaymentsType = dd.DDCode and dd.DDType = 'PaymentsType'
	where r.orderId = fc.orderId
	and dd.DDName in ('安庆-农业-尾号7373','安阳-邮政-尾号1405','安阳-中信-尾号5411','保定-建设-尾号1949','保定-建设-尾号3500','北京-建设-尾号9353','常州-建设-尾号6103','成都-农业-尾号6268','福州-建设-尾号0027','福州-建设-尾号5348','福州-民生-尾号2732','工行汇款-黄森','工商银行-北京-尾号4517','工商银行-焦作-尾号4943','广州-建设-尾号8637','广州-交通-尾号6875','哈尔滨-建设-尾号2054','杭州-杭州-尾号8950','杭州-招商-尾号9653','合肥-交通-尾号5692','合肥-民生-尾号2096','菏泽-建设-尾号7999','衡阳-工商-尾号9013','济南-建设-尾号9838','济南-民生-尾号1122','济南-农行-尾号4603','济南-农业-尾号9637','济宁-中信-尾号9171','焦作-工行-尾号7987','焦作-建设-尾号0362','荆州-农商-尾号7063','开封-农信-尾号2624','六安-建设-尾号2190','洛阳-交通-尾号7925','南昌-中国-尾号6262','南京-中国-尾号8715','南京-中信-尾号6164','南阳-邮政-尾号9931','平顶山-工商-尾号0007','青岛-工行-尾号6830','青岛-工商-尾号1036','全国通用-易宝刷卡-培训学校','上海-建设-尾号9142','上海-民生-尾号4790','上海-农业-尾号1204','上海-中行-尾号1279','沈阳-建行-尾号0532','沈阳-交通-尾号2406','沈阳-盛京-尾号3390','石家庄-民生-尾号0037','石家庄-民生-尾号6129','石家庄-中信-尾号2265','石家庄-中信-尾号4151','苏州-工商-尾号0787','苏州-农行-尾号3024','苏州-农业-尾号0822','太原-民生-尾号8389','天津-中信-尾号1344','天津-中信-尾号3784','潍坊-招商-尾号8418','乌鲁木齐-中行-尾号5249','武汉-建行-尾号1275','武汉-农商-尾号0012','武汉-农业-尾号4678','武汉-兴业-尾号5712','西安-中信-尾号8691','西宁-工商-尾号3407','襄阳-中国-尾号5185','新乡-工商-尾号1324','新乡-建设-尾号6120','徐州-农业-尾号0703','许昌-建设-尾号6281','许昌-中原-尾号6730','阳泉-建设-尾号9026','宜昌-建设-尾号6183','榆林-中信-尾号7009','运城-工商-尾号5962','长春-建行-尾号0641','郑州-建设-尾号5173','郑州-建设-尾号6159','郑州-郑州-尾号5186','重庆-农业-尾号7248','周口-中原-尾号8641','全国通用-易宝刷卡-其它','上海-淘宝','郑州-汇付天下','郑州-工商-尾号3594','全国通用-现金','全国通用-中信卡','全国通用-农商-卓越盈佳','文盛-对公支付宝','环优盛文-客来乐-支付宝','环优-拉卡拉','环优盛文-客来乐-微信','环优-中信-尾号3814','京东-对公支付-北京','环优盛文-客来乐-支付宝','环优-拉卡拉','环优盛文-客来乐-微信','环优-中信-尾号3814','优一点-客来乐-支付宝','优一点-客来乐-微信','优一点-新大陆','优一点-民生-5150','全国通用-现金','全国通用-中信卡','全国通用-农商-卓越盈佳','全国通用-易宝刷卡-培训学校','文盛-对公支付宝','上海-淘宝','京东-对公支付-北京')
)
and fc.OrderType in ('06','07','08','09','10','99')
and fc.CreatedOn BETWEEN  '2018-01-01 00:00:00.001' and '2020-10-31 23:59:59.999'  

