------------------------修改后


--系统总订单量 56608
select count(*) from FC_Order 

-- 符合迁移规则的订单量 19164  
select count(*) from FC_Order fc  WITH (NOLOCK)
where not exists (
	select 1
	from FC_Receipt r 
	join   FC_SalesChargeDetail s  on r.ReceiptGuid = s.ReceiptGuid
	join  SYS_DD dd on  s.PaymentsType = dd.DDCode and dd.DDType = 'PaymentsType'
	where r.orderId = fc.orderId
	and dd.DDName in ('安庆-农业-尾号7373','安阳-邮政-尾号1405','安阳-中信-尾号5411','保定-建设-尾号1949','保定-建设-尾号3500','北京-建设-尾号9353','常州-建设-尾号6103','成都-农业-尾号6268','福州-建设-尾号0027','福州-建设-尾号5348','福州-民生-尾号2732','工行汇款-黄森','工商银行-北京-尾号4517','工商银行-焦作-尾号4943','广州-建设-尾号8637','广州-交通-尾号6875','哈尔滨-建设-尾号2054','杭州-杭州-尾号8950','杭州-招商-尾号9653','合肥-交通-尾号5692','合肥-民生-尾号2096','菏泽-建设-尾号7999','衡阳-工商-尾号9013','济南-建设-尾号9838','济南-民生-尾号1122','济南-农行-尾号4603','济南-农业-尾号9637','济宁-中信-尾号9171','焦作-工行-尾号7987','焦作-建设-尾号0362','荆州-农商-尾号7063','开封-农信-尾号2624','六安-建设-尾号2190','洛阳-交通-尾号7925','南昌-中国-尾号6262','南京-中国-尾号8715','南京-中信-尾号6164','南阳-邮政-尾号9931','平顶山-工商-尾号0007','青岛-工行-尾号6830','青岛-工商-尾号1036','全国通用-易宝刷卡-培训学校','上海-建设-尾号9142','上海-民生-尾号4790','上海-农业-尾号1204','上海-中行-尾号1279','沈阳-建行-尾号0532','沈阳-交通-尾号2406','沈阳-盛京-尾号3390','石家庄-民生-尾号0037','石家庄-民生-尾号6129','石家庄-中信-尾号2265','石家庄-中信-尾号4151','苏州-工商-尾号0787','苏州-农行-尾号3024','苏州-农业-尾号0822','太原-民生-尾号8389','天津-中信-尾号1344','天津-中信-尾号3784','潍坊-招商-尾号8418','乌鲁木齐-中行-尾号5249','武汉-建行-尾号1275','武汉-农商-尾号0012','武汉-农业-尾号4678','武汉-兴业-尾号5712','西安-中信-尾号8691','西宁-工商-尾号3407','襄阳-中国-尾号5185','新乡-工商-尾号1324','新乡-建设-尾号6120','徐州-农业-尾号0703','许昌-建设-尾号6281','许昌-中原-尾号6730','阳泉-建设-尾号9026','宜昌-建设-尾号6183','榆林-中信-尾号7009','运城-工商-尾号5962','长春-建行-尾号0641','郑州-建设-尾号5173','郑州-建设-尾号6159','郑州-郑州-尾号5186','重庆-农业-尾号7248','周口-中原-尾号8641','全国通用-易宝刷卡-其它','上海-淘宝','郑州-汇付天下','郑州-工商-尾号3594','全国通用-现金','全国通用-中信卡','全国通用-农商-卓越盈佳','文盛-对公支付宝','环优盛文-客来乐-支付宝','环优-拉卡拉','环优盛文-客来乐-微信','环优-中信-尾号3814','京东-对公支付-北京','环优盛文-客来乐-支付宝','环优-拉卡拉','环优盛文-客来乐-微信','环优-中信-尾号3814','优一点-客来乐-支付宝','优一点-客来乐-微信','优一点-新大陆','优一点-民生-5150','全国通用-现金','全国通用-中信卡','全国通用-农商-卓越盈佳','全国通用-易宝刷卡-培训学校','文盛-对公支付宝','上海-淘宝','京东-对公支付-北京')
)
and fc.OrderType in ('01','02','03','04','05')
and fc.CreatedOn BETWEEN  '2018-01-01 00:00:00.001' and '2020-10-31 23:59:59.999'  
-- select DISTINCT fc.OrderId from FC_Order fc  WITH (NOLOCK)
-- JOIN  FC_Receipt receipt   on fc.OrderId = receipt.OrderId  
-- JOIN  FC_SalesChargeDetail sales  on receipt.ReceiptGuid = sales.ReceiptGuid
-- JOIN SYS_DD dd on  sales.PaymentsType = dd.DDCode
-- where  fc.CreatedOn BETWEEN  '2018-01-01 00:00:00.001' and '2020-10-31 23:59:59.999'  
-- and fc.OrderType in ('01','02','03','04','05')
-- and dd.DDType = 'PaymentsType'
-- and dd.DDName not in ('安庆-农业-尾号7373','安阳-邮政-尾号1405','安阳-中信-尾号5411','保定-建设-尾号1949','保定-建设-尾号3500','北京-建设-尾号9353','常州-建设-尾号6103','成都-农业-尾号6268','福州-建设-尾号0027','福州-建设-尾号5348','福州-民生-尾号2732','工行汇款-黄森','工商银行-北京-尾号4517','工商银行-焦作-尾号4943','广州-建设-尾号8637','广州-交通-尾号6875','哈尔滨-建设-尾号2054','杭州-杭州-尾号8950','杭州-招商-尾号9653','合肥-交通-尾号5692','合肥-民生-尾号2096','菏泽-建设-尾号7999','衡阳-工商-尾号9013','济南-建设-尾号9838','济南-民生-尾号1122','济南-农行-尾号4603','济南-农业-尾号9637','济宁-中信-尾号9171','焦作-工行-尾号7987','焦作-建设-尾号0362','荆州-农商-尾号7063','开封-农信-尾号2624','六安-建设-尾号2190','洛阳-交通-尾号7925','南昌-中国-尾号6262','南京-中国-尾号8715','南京-中信-尾号6164','南阳-邮政-尾号9931','平顶山-工商-尾号0007','青岛-工行-尾号6830','青岛-工商-尾号1036','全国通用-易宝刷卡-培训学校','上海-建设-尾号9142','上海-民生-尾号4790','上海-农业-尾号1204','上海-中行-尾号1279','沈阳-建行-尾号0532','沈阳-交通-尾号2406','沈阳-盛京-尾号3390','石家庄-民生-尾号0037','石家庄-民生-尾号6129','石家庄-中信-尾号2265','石家庄-中信-尾号4151','苏州-工商-尾号0787','苏州-农行-尾号3024','苏州-农业-尾号0822','太原-民生-尾号8389','天津-中信-尾号1344','天津-中信-尾号3784','潍坊-招商-尾号8418','乌鲁木齐-中行-尾号5249','武汉-建行-尾号1275','武汉-农商-尾号0012','武汉-农业-尾号4678','武汉-兴业-尾号5712','西安-中信-尾号8691','西宁-工商-尾号3407','襄阳-中国-尾号5185','新乡-工商-尾号1324','新乡-建设-尾号6120','徐州-农业-尾号0703','许昌-建设-尾号6281','许昌-中原-尾号6730','阳泉-建设-尾号9026','宜昌-建设-尾号6183','榆林-中信-尾号7009','运城-工商-尾号5962','长春-建行-尾号0641','郑州-建设-尾号5173','郑州-建设-尾号6159','郑州-郑州-尾号5186','重庆-农业-尾号7248','周口-中原-尾号8641','全国通用-易宝刷卡-其它','上海-淘宝','郑州-汇付天下','郑州-工商-尾号3594','全国通用-现金','全国通用-中信卡','全国通用-农商-卓越盈佳','文盛-对公支付宝','环优盛文-客来乐-支付宝','环优-拉卡拉','环优盛文-客来乐-微信','环优-中信-尾号3814','京东-对公支付-北京','环优盛文-客来乐-支付宝','环优-拉卡拉','环优盛文-客来乐-微信','环优-中信-尾号3814','优一点-客来乐-支付宝','优一点-客来乐-微信','优一点-新大陆','优一点-民生-5150','全国通用-现金','全国通用-中信卡','全国通用-农商-卓越盈佳','全国通用-易宝刷卡-培训学校','文盛-对公支付宝','上海-淘宝','京东-对公支付-北京')

-- 不符合迁移规则的订单量 
    --不在预期时间之内的 28929
select count(fc.OrderId) from FC_Order fc
where  fc.CreatedOn not BETWEEN  '2018-01-01 00:00:00.001' and '2020-10-31 23:59:59.999'  

    -- 有效日期内 不符合指定付款条件的 8248
select count(*) from FC_Order fc  WITH (NOLOCK)
where exists (
	select 1
	from FC_Receipt r 
	join   FC_SalesChargeDetail s  on r.ReceiptGuid = s.ReceiptGuid
	join  SYS_DD dd on  s.PaymentsType = dd.DDCode and dd.DDType = 'PaymentsType'
	where r.orderId = fc.orderId
	and dd.DDName in ('安庆-农业-尾号7373','安阳-邮政-尾号1405','安阳-中信-尾号5411','保定-建设-尾号1949','保定-建设-尾号3500','北京-建设-尾号9353','常州-建设-尾号6103','成都-农业-尾号6268','福州-建设-尾号0027','福州-建设-尾号5348','福州-民生-尾号2732','工行汇款-黄森','工商银行-北京-尾号4517','工商银行-焦作-尾号4943','广州-建设-尾号8637','广州-交通-尾号6875','哈尔滨-建设-尾号2054','杭州-杭州-尾号8950','杭州-招商-尾号9653','合肥-交通-尾号5692','合肥-民生-尾号2096','菏泽-建设-尾号7999','衡阳-工商-尾号9013','济南-建设-尾号9838','济南-民生-尾号1122','济南-农行-尾号4603','济南-农业-尾号9637','济宁-中信-尾号9171','焦作-工行-尾号7987','焦作-建设-尾号0362','荆州-农商-尾号7063','开封-农信-尾号2624','六安-建设-尾号2190','洛阳-交通-尾号7925','南昌-中国-尾号6262','南京-中国-尾号8715','南京-中信-尾号6164','南阳-邮政-尾号9931','平顶山-工商-尾号0007','青岛-工行-尾号6830','青岛-工商-尾号1036','全国通用-易宝刷卡-培训学校','上海-建设-尾号9142','上海-民生-尾号4790','上海-农业-尾号1204','上海-中行-尾号1279','沈阳-建行-尾号0532','沈阳-交通-尾号2406','沈阳-盛京-尾号3390','石家庄-民生-尾号0037','石家庄-民生-尾号6129','石家庄-中信-尾号2265','石家庄-中信-尾号4151','苏州-工商-尾号0787','苏州-农行-尾号3024','苏州-农业-尾号0822','太原-民生-尾号8389','天津-中信-尾号1344','天津-中信-尾号3784','潍坊-招商-尾号8418','乌鲁木齐-中行-尾号5249','武汉-建行-尾号1275','武汉-农商-尾号0012','武汉-农业-尾号4678','武汉-兴业-尾号5712','西安-中信-尾号8691','西宁-工商-尾号3407','襄阳-中国-尾号5185','新乡-工商-尾号1324','新乡-建设-尾号6120','徐州-农业-尾号0703','许昌-建设-尾号6281','许昌-中原-尾号6730','阳泉-建设-尾号9026','宜昌-建设-尾号6183','榆林-中信-尾号7009','运城-工商-尾号5962','长春-建行-尾号0641','郑州-建设-尾号5173','郑州-建设-尾号6159','郑州-郑州-尾号5186','重庆-农业-尾号7248','周口-中原-尾号8641','全国通用-易宝刷卡-其它','上海-淘宝','郑州-汇付天下','郑州-工商-尾号3594','全国通用-现金','全国通用-中信卡','全国通用-农商-卓越盈佳','文盛-对公支付宝','环优盛文-客来乐-支付宝','环优-拉卡拉','环优盛文-客来乐-微信','环优-中信-尾号3814','京东-对公支付-北京','环优盛文-客来乐-支付宝','环优-拉卡拉','环优盛文-客来乐-微信','环优-中信-尾号3814','优一点-客来乐-支付宝','优一点-客来乐-微信','优一点-新大陆','优一点-民生-5150','全国通用-现金','全国通用-中信卡','全国通用-农商-卓越盈佳','全国通用-易宝刷卡-培训学校','文盛-对公支付宝','上海-淘宝','京东-对公支付-北京')
)
and fc.CreatedOn BETWEEN  '2018-01-01 00:00:00.001' and '2020-10-31 23:59:59.999' 

-- select DISTINCT fc.OrderId from FC_Order fc  WITH (NOLOCK)
-- Left JOIN  FC_Receipt receipt   on fc.OrderId = receipt.OrderId  
-- Left JOIN  FC_SalesChargeDetail sales  on receipt.ReceiptGuid = sales.ReceiptGuid
-- Left JOIN SYS_DD dd on  sales.PaymentsType = dd.DDCode
-- where  fc.CreatedOn BETWEEN  '2018-01-01 00:00:00.001' and '2020-10-31 23:59:59.999'  
-- and dd.DDType = 'PaymentsType'
-- and dd.DDName in ('安庆-农业-尾号7373','安阳-邮政-尾号1405','安阳-中信-尾号5411','保定-建设-尾号1949','保定-建设-尾号3500','北京-建设-尾号9353','常州-建设-尾号6103','成都-农业-尾号6268','福州-建设-尾号0027','福州-建设-尾号5348','福州-民生-尾号2732','工行汇款-黄森','工商银行-北京-尾号4517','工商银行-焦作-尾号4943','广州-建设-尾号8637','广州-交通-尾号6875','哈尔滨-建设-尾号2054','杭州-杭州-尾号8950','杭州-招商-尾号9653','合肥-交通-尾号5692','合肥-民生-尾号2096','菏泽-建设-尾号7999','衡阳-工商-尾号9013','济南-建设-尾号9838','济南-民生-尾号1122','济南-农行-尾号4603','济南-农业-尾号9637','济宁-中信-尾号9171','焦作-工行-尾号7987','焦作-建设-尾号0362','荆州-农商-尾号7063','开封-农信-尾号2624','六安-建设-尾号2190','洛阳-交通-尾号7925','南昌-中国-尾号6262','南京-中国-尾号8715','南京-中信-尾号6164','南阳-邮政-尾号9931','平顶山-工商-尾号0007','青岛-工行-尾号6830','青岛-工商-尾号1036','全国通用-易宝刷卡-培训学校','上海-建设-尾号9142','上海-民生-尾号4790','上海-农业-尾号1204','上海-中行-尾号1279','沈阳-建行-尾号0532','沈阳-交通-尾号2406','沈阳-盛京-尾号3390','石家庄-民生-尾号0037','石家庄-民生-尾号6129','石家庄-中信-尾号2265','石家庄-中信-尾号4151','苏州-工商-尾号0787','苏州-农行-尾号3024','苏州-农业-尾号0822','太原-民生-尾号8389','天津-中信-尾号1344','天津-中信-尾号3784','潍坊-招商-尾号8418','乌鲁木齐-中行-尾号5249','武汉-建行-尾号1275','武汉-农商-尾号0012','武汉-农业-尾号4678','武汉-兴业-尾号5712','西安-中信-尾号8691','西宁-工商-尾号3407','襄阳-中国-尾号5185','新乡-工商-尾号1324','新乡-建设-尾号6120','徐州-农业-尾号0703','许昌-建设-尾号6281','许昌-中原-尾号6730','阳泉-建设-尾号9026','宜昌-建设-尾号6183','榆林-中信-尾号7009','运城-工商-尾号5962','长春-建行-尾号0641','郑州-建设-尾号5173','郑州-建设-尾号6159','郑州-郑州-尾号5186','重庆-农业-尾号7248','周口-中原-尾号8641','全国通用-易宝刷卡-其它','上海-淘宝','郑州-汇付天下','郑州-工商-尾号3594','全国通用-现金','全国通用-中信卡','全国通用-农商-卓越盈佳','文盛-对公支付宝','环优盛文-客来乐-支付宝','环优-拉卡拉','环优盛文-客来乐-微信','环优-中信-尾号3814','京东-对公支付-北京','环优盛文-客来乐-支付宝','环优-拉卡拉','环优盛文-客来乐-微信','环优-中信-尾号3814','优一点-客来乐-支付宝','优一点-客来乐-微信','优一点-新大陆','优一点-民生-5150','全国通用-现金','全国通用-中信卡','全国通用-农商-卓越盈佳','全国通用-易宝刷卡-培训学校','文盛-对公支付宝','上海-淘宝','京东-对公支付-北京')

    -- 符合迁移规则的订单量,不符合迁移订单类型的  264
select count(*) from FC_Order fc  WITH (NOLOCK)
where not exists (
	select 1
	from FC_Receipt r 
	join   FC_SalesChargeDetail s  on r.ReceiptGuid = s.ReceiptGuid
	join  SYS_DD dd on  s.PaymentsType = dd.DDCode and dd.DDType = 'PaymentsType'
	where r.orderId = fc.orderId
	and dd.DDName in ('安庆-农业-尾号7373','安阳-邮政-尾号1405','安阳-中信-尾号5411','保定-建设-尾号1949','保定-建设-尾号3500','北京-建设-尾号9353','常州-建设-尾号6103','成都-农业-尾号6268','福州-建设-尾号0027','福州-建设-尾号5348','福州-民生-尾号2732','工行汇款-黄森','工商银行-北京-尾号4517','工商银行-焦作-尾号4943','广州-建设-尾号8637','广州-交通-尾号6875','哈尔滨-建设-尾号2054','杭州-杭州-尾号8950','杭州-招商-尾号9653','合肥-交通-尾号5692','合肥-民生-尾号2096','菏泽-建设-尾号7999','衡阳-工商-尾号9013','济南-建设-尾号9838','济南-民生-尾号1122','济南-农行-尾号4603','济南-农业-尾号9637','济宁-中信-尾号9171','焦作-工行-尾号7987','焦作-建设-尾号0362','荆州-农商-尾号7063','开封-农信-尾号2624','六安-建设-尾号2190','洛阳-交通-尾号7925','南昌-中国-尾号6262','南京-中国-尾号8715','南京-中信-尾号6164','南阳-邮政-尾号9931','平顶山-工商-尾号0007','青岛-工行-尾号6830','青岛-工商-尾号1036','全国通用-易宝刷卡-培训学校','上海-建设-尾号9142','上海-民生-尾号4790','上海-农业-尾号1204','上海-中行-尾号1279','沈阳-建行-尾号0532','沈阳-交通-尾号2406','沈阳-盛京-尾号3390','石家庄-民生-尾号0037','石家庄-民生-尾号6129','石家庄-中信-尾号2265','石家庄-中信-尾号4151','苏州-工商-尾号0787','苏州-农行-尾号3024','苏州-农业-尾号0822','太原-民生-尾号8389','天津-中信-尾号1344','天津-中信-尾号3784','潍坊-招商-尾号8418','乌鲁木齐-中行-尾号5249','武汉-建行-尾号1275','武汉-农商-尾号0012','武汉-农业-尾号4678','武汉-兴业-尾号5712','西安-中信-尾号8691','西宁-工商-尾号3407','襄阳-中国-尾号5185','新乡-工商-尾号1324','新乡-建设-尾号6120','徐州-农业-尾号0703','许昌-建设-尾号6281','许昌-中原-尾号6730','阳泉-建设-尾号9026','宜昌-建设-尾号6183','榆林-中信-尾号7009','运城-工商-尾号5962','长春-建行-尾号0641','郑州-建设-尾号5173','郑州-建设-尾号6159','郑州-郑州-尾号5186','重庆-农业-尾号7248','周口-中原-尾号8641','全国通用-易宝刷卡-其它','上海-淘宝','郑州-汇付天下','郑州-工商-尾号3594','全国通用-现金','全国通用-中信卡','全国通用-农商-卓越盈佳','文盛-对公支付宝','环优盛文-客来乐-支付宝','环优-拉卡拉','环优盛文-客来乐-微信','环优-中信-尾号3814','京东-对公支付-北京','环优盛文-客来乐-支付宝','环优-拉卡拉','环优盛文-客来乐-微信','环优-中信-尾号3814','优一点-客来乐-支付宝','优一点-客来乐-微信','优一点-新大陆','优一点-民生-5150','全国通用-现金','全国通用-中信卡','全国通用-农商-卓越盈佳','全国通用-易宝刷卡-培训学校','文盛-对公支付宝','上海-淘宝','京东-对公支付-北京')
)
and fc.OrderType in ('06','07','08','09','10','99')
and fc.CreatedOn BETWEEN  '2018-01-01 00:00:00.001' and '2020-10-31 23:59:59.999'  


-- 各分校迁移前总量

select b.BranchName ,count(*)num from FC_Order fc
LEFT JOIN SYS_Branch b on fc.OrderOwningCompany = b.BranchId
group by  b.BranchName
order by num desc

-- sum ==  56608
select sum(num) from(
select b.BranchName ,count(*)num from FC_Order fc
LEFT JOIN SYS_Branch b on fc.OrderOwningCompany = b.BranchId
group by  b.BranchName
order by num desc
) a
-- 北京医药	10939
-- 郑州	5306
-- 石家庄	5284
-- 济南	5164
-- 北京工程	4430
-- 上海	3457
-- 广州	2830
-- 南京	2620
-- 杭州	2132
-- 重庆	1891
-- 集团总部	1448
-- 青岛	995
-- 沈阳	994
-- 徐州	981
-- 成都	925
-- 苏州	840
-- 武汉	837
-- 天津	721
-- 福州	682
-- 南宁	544
-- 长沙	435
-- 长春	407
-- 合肥	406
-- 洛阳	404
-- 西安	253
-- 攀枝花	205
-- 太原	205
-- 衡阳	186
-- 保定	183
-- 六安	131
-- 南昌	120
-- 万州	112
-- 锦州	53
-- 安庆	35
-- 邯郸	30
-- 无锡	29
-- 新乡	28
-- 南充	24
-- 哈尔滨	23
-- 焦作	22
-- 唐山	19
-- 商丘	19
-- 开封	18
-- 珠海	14
-- 宁波	14
-- 荆门	14
-- 厦门	12
-- 南通	11
-- 南阳	11
-- 大连	9
-- 安阳	8
-- 连云港	8
-- 阳泉	7
-- 呼和浩特	7
-- 常州	7
-- 扬州	7
-- 济宁	7
-- 优路网校	6
-- 宜昌	6
-- 平顶山	6
-- 温州	6
-- 黄冈	6
-- 昆明	6
-- 大同	5
-- 临沂	4
-- 兰州	4
-- 驻马店	4
-- 漳州	4
-- Crm4测试分校	4
-- 周口	4
-- 荆州	3
-- 金华	3
-- 秦皇岛	3
-- 张家口	2
-- 宜宾	2
-- 菏泽	2
-- 廊坊	2
-- 惠州	2
-- 长治	2
-- 四平	2
-- 大庆	2
-- 襄阳	2
-- bj测试分校	1
-- 银川	1
-- 泸州	1
-- 烟台	1
-- 泉州	1
-- 泰州	1
-- 许昌	1
-- 淮安	1
-- 漯河	1
-- 绵阳	1
-- 沧州	1
-- 衡水	1
-- 吴忠	1
 

-- 各分校迁移前 符合 迁移规则总量
SELECT b.BranchName ,count(*) num FROM
(select DISTINCT fc.OrderId ,fc.OrderOwningCompany  from FC_Order fc  WITH (NOLOCK)
where not exists (
	select 1
	from FC_Receipt r 
	join   FC_SalesChargeDetail s  on r.ReceiptGuid = s.ReceiptGuid
	join  SYS_DD dd on  s.PaymentsType = dd.DDCode and dd.DDType = 'PaymentsType'
	where r.orderId = fc.orderId
	and dd.DDName in ('安庆-农业-尾号7373','安阳-邮政-尾号1405','安阳-中信-尾号5411','保定-建设-尾号1949','保定-建设-尾号3500','北京-建设-尾号9353','常州-建设-尾号6103','成都-农业-尾号6268','福州-建设-尾号0027','福州-建设-尾号5348','福州-民生-尾号2732','工行汇款-黄森','工商银行-北京-尾号4517','工商银行-焦作-尾号4943','广州-建设-尾号8637','广州-交通-尾号6875','哈尔滨-建设-尾号2054','杭州-杭州-尾号8950','杭州-招商-尾号9653','合肥-交通-尾号5692','合肥-民生-尾号2096','菏泽-建设-尾号7999','衡阳-工商-尾号9013','济南-建设-尾号9838','济南-民生-尾号1122','济南-农行-尾号4603','济南-农业-尾号9637','济宁-中信-尾号9171','焦作-工行-尾号7987','焦作-建设-尾号0362','荆州-农商-尾号7063','开封-农信-尾号2624','六安-建设-尾号2190','洛阳-交通-尾号7925','南昌-中国-尾号6262','南京-中国-尾号8715','南京-中信-尾号6164','南阳-邮政-尾号9931','平顶山-工商-尾号0007','青岛-工行-尾号6830','青岛-工商-尾号1036','全国通用-易宝刷卡-培训学校','上海-建设-尾号9142','上海-民生-尾号4790','上海-农业-尾号1204','上海-中行-尾号1279','沈阳-建行-尾号0532','沈阳-交通-尾号2406','沈阳-盛京-尾号3390','石家庄-民生-尾号0037','石家庄-民生-尾号6129','石家庄-中信-尾号2265','石家庄-中信-尾号4151','苏州-工商-尾号0787','苏州-农行-尾号3024','苏州-农业-尾号0822','太原-民生-尾号8389','天津-中信-尾号1344','天津-中信-尾号3784','潍坊-招商-尾号8418','乌鲁木齐-中行-尾号5249','武汉-建行-尾号1275','武汉-农商-尾号0012','武汉-农业-尾号4678','武汉-兴业-尾号5712','西安-中信-尾号8691','西宁-工商-尾号3407','襄阳-中国-尾号5185','新乡-工商-尾号1324','新乡-建设-尾号6120','徐州-农业-尾号0703','许昌-建设-尾号6281','许昌-中原-尾号6730','阳泉-建设-尾号9026','宜昌-建设-尾号6183','榆林-中信-尾号7009','运城-工商-尾号5962','长春-建行-尾号0641','郑州-建设-尾号5173','郑州-建设-尾号6159','郑州-郑州-尾号5186','重庆-农业-尾号7248','周口-中原-尾号8641','全国通用-易宝刷卡-其它','上海-淘宝','郑州-汇付天下','郑州-工商-尾号3594','全国通用-现金','全国通用-中信卡','全国通用-农商-卓越盈佳','文盛-对公支付宝','环优盛文-客来乐-支付宝','环优-拉卡拉','环优盛文-客来乐-微信','环优-中信-尾号3814','京东-对公支付-北京','环优盛文-客来乐-支付宝','环优-拉卡拉','环优盛文-客来乐-微信','环优-中信-尾号3814','优一点-客来乐-支付宝','优一点-客来乐-微信','优一点-新大陆','优一点-民生-5150','全国通用-现金','全国通用-中信卡','全国通用-农商-卓越盈佳','全国通用-易宝刷卡-培训学校','文盛-对公支付宝','上海-淘宝','京东-对公支付-北京')
)
and fc.OrderType in ('01','02','03','04','05')
and fc.CreatedOn BETWEEN  '2018-01-01 00:00:00.001' and '2020-10-31 23:59:59.999'  
) a
LEFT JOIN SYS_Branch b WITH (NOLOCK)  on a.OrderOwningCompany = b.BranchId
group by  b.BranchName
ORDER BY num desc

-- 求和  19164
select sum(num) from (
SELECT b.BranchName ,count(*) num FROM
(select DISTINCT fc.OrderId ,fc.OrderOwningCompany  from FC_Order fc  WITH (NOLOCK)
where not exists (
	select 1
	from FC_Receipt r 
	join   FC_SalesChargeDetail s  on r.ReceiptGuid = s.ReceiptGuid
	join  SYS_DD dd on  s.PaymentsType = dd.DDCode and dd.DDType = 'PaymentsType'
	where r.orderId = fc.orderId
	and dd.DDName in ('安庆-农业-尾号7373','安阳-邮政-尾号1405','安阳-中信-尾号5411','保定-建设-尾号1949','保定-建设-尾号3500','北京-建设-尾号9353','常州-建设-尾号6103','成都-农业-尾号6268','福州-建设-尾号0027','福州-建设-尾号5348','福州-民生-尾号2732','工行汇款-黄森','工商银行-北京-尾号4517','工商银行-焦作-尾号4943','广州-建设-尾号8637','广州-交通-尾号6875','哈尔滨-建设-尾号2054','杭州-杭州-尾号8950','杭州-招商-尾号9653','合肥-交通-尾号5692','合肥-民生-尾号2096','菏泽-建设-尾号7999','衡阳-工商-尾号9013','济南-建设-尾号9838','济南-民生-尾号1122','济南-农行-尾号4603','济南-农业-尾号9637','济宁-中信-尾号9171','焦作-工行-尾号7987','焦作-建设-尾号0362','荆州-农商-尾号7063','开封-农信-尾号2624','六安-建设-尾号2190','洛阳-交通-尾号7925','南昌-中国-尾号6262','南京-中国-尾号8715','南京-中信-尾号6164','南阳-邮政-尾号9931','平顶山-工商-尾号0007','青岛-工行-尾号6830','青岛-工商-尾号1036','全国通用-易宝刷卡-培训学校','上海-建设-尾号9142','上海-民生-尾号4790','上海-农业-尾号1204','上海-中行-尾号1279','沈阳-建行-尾号0532','沈阳-交通-尾号2406','沈阳-盛京-尾号3390','石家庄-民生-尾号0037','石家庄-民生-尾号6129','石家庄-中信-尾号2265','石家庄-中信-尾号4151','苏州-工商-尾号0787','苏州-农行-尾号3024','苏州-农业-尾号0822','太原-民生-尾号8389','天津-中信-尾号1344','天津-中信-尾号3784','潍坊-招商-尾号8418','乌鲁木齐-中行-尾号5249','武汉-建行-尾号1275','武汉-农商-尾号0012','武汉-农业-尾号4678','武汉-兴业-尾号5712','西安-中信-尾号8691','西宁-工商-尾号3407','襄阳-中国-尾号5185','新乡-工商-尾号1324','新乡-建设-尾号6120','徐州-农业-尾号0703','许昌-建设-尾号6281','许昌-中原-尾号6730','阳泉-建设-尾号9026','宜昌-建设-尾号6183','榆林-中信-尾号7009','运城-工商-尾号5962','长春-建行-尾号0641','郑州-建设-尾号5173','郑州-建设-尾号6159','郑州-郑州-尾号5186','重庆-农业-尾号7248','周口-中原-尾号8641','全国通用-易宝刷卡-其它','上海-淘宝','郑州-汇付天下','郑州-工商-尾号3594','全国通用-现金','全国通用-中信卡','全国通用-农商-卓越盈佳','文盛-对公支付宝','环优盛文-客来乐-支付宝','环优-拉卡拉','环优盛文-客来乐-微信','环优-中信-尾号3814','京东-对公支付-北京','环优盛文-客来乐-支付宝','环优-拉卡拉','环优盛文-客来乐-微信','环优-中信-尾号3814','优一点-客来乐-支付宝','优一点-客来乐-微信','优一点-新大陆','优一点-民生-5150','全国通用-现金','全国通用-中信卡','全国通用-农商-卓越盈佳','全国通用-易宝刷卡-培训学校','文盛-对公支付宝','上海-淘宝','京东-对公支付-北京')
)
and fc.OrderType in ('01','02','03','04','05')
and fc.CreatedOn BETWEEN  '2018-01-01 00:00:00.001' and '2020-10-31 23:59:59.999'  
) a
LEFT JOIN SYS_Branch b WITH (NOLOCK)  on a.OrderOwningCompany = b.BranchId
group by  b.BranchName
) a

-- 北京医药	4556
-- 郑州	2174
-- 济南	2028
-- 石家庄	1781
-- 广州	949
-- 重庆	852
-- 上海	831
-- 南京	782
-- 杭州	582
-- 苏州	444
-- 徐州	442
-- 沈阳	431
-- 青岛	397
-- 成都	369
-- 南宁	326
-- 洛阳	230
-- 长春	227
-- 武汉	224
-- 攀枝花	192
-- 福州	174
-- 北京工程	167
-- 合肥	142
-- 天津	114
-- 长沙	113
-- 万州	104
-- 衡阳	97
-- 保定	95
-- 六安	69
-- 南昌	30
-- 集团总部	22
-- 西安	21
-- 太原	17
-- 南充	15
-- 荆门	13
-- 珠海	12
-- 南阳	11
-- 哈尔滨	11
-- 邯郸	8
-- 无锡	8
-- 新乡	7
-- 开封	6
-- 唐山	6
-- 焦作	5
-- 黄冈	5
-- 常州	5
-- 锦州	5
-- 大同	4
-- 漳州	4
-- 驻马店	4
-- 厦门	4
-- 安庆	3
-- 宁波	3
-- 兰州	3
-- 优路网校	3
-- Crm4测试分校	3
-- 安阳	2
-- 南通	2
-- 阳泉	2
-- 四平	2
-- 大庆	2
-- 惠州	2
-- 金华	2
-- 淮安	1
-- 长治	1
-- 衡水	1
-- 呼和浩特	1
-- 昆明	1
-- 泉州	1
-- 泰州	1
-- 温州	1
-- 菏泽	1
-- 廊坊	1
-- 临沂	1
-- 漯河	1
-- 张家口	1
-- 吴忠	1
-- 秦皇岛	1
-- bj测试分校	1
-- 襄阳	1
-- 荆州	1
-- 银川	1
-- 泸州	1



-- 各个分校，符合迁移规则的订单中,不符合迁移订单类型的  264
SELECT b.BranchName ,count(*) num FROM
(select DISTINCT fc.OrderId ,fc.OrderOwningCompany  from FC_Order fc 
where not exists (
	select 1
	from FC_Receipt r 
	join   FC_SalesChargeDetail s  on r.ReceiptGuid = s.ReceiptGuid
	join  SYS_DD dd on  s.PaymentsType = dd.DDCode and dd.DDType = 'PaymentsType'
	where r.orderId = fc.orderId
	and dd.DDName in ('安庆-农业-尾号7373','安阳-邮政-尾号1405','安阳-中信-尾号5411','保定-建设-尾号1949','保定-建设-尾号3500','北京-建设-尾号9353','常州-建设-尾号6103','成都-农业-尾号6268','福州-建设-尾号0027','福州-建设-尾号5348','福州-民生-尾号2732','工行汇款-黄森','工商银行-北京-尾号4517','工商银行-焦作-尾号4943','广州-建设-尾号8637','广州-交通-尾号6875','哈尔滨-建设-尾号2054','杭州-杭州-尾号8950','杭州-招商-尾号9653','合肥-交通-尾号5692','合肥-民生-尾号2096','菏泽-建设-尾号7999','衡阳-工商-尾号9013','济南-建设-尾号9838','济南-民生-尾号1122','济南-农行-尾号4603','济南-农业-尾号9637','济宁-中信-尾号9171','焦作-工行-尾号7987','焦作-建设-尾号0362','荆州-农商-尾号7063','开封-农信-尾号2624','六安-建设-尾号2190','洛阳-交通-尾号7925','南昌-中国-尾号6262','南京-中国-尾号8715','南京-中信-尾号6164','南阳-邮政-尾号9931','平顶山-工商-尾号0007','青岛-工行-尾号6830','青岛-工商-尾号1036','全国通用-易宝刷卡-培训学校','上海-建设-尾号9142','上海-民生-尾号4790','上海-农业-尾号1204','上海-中行-尾号1279','沈阳-建行-尾号0532','沈阳-交通-尾号2406','沈阳-盛京-尾号3390','石家庄-民生-尾号0037','石家庄-民生-尾号6129','石家庄-中信-尾号2265','石家庄-中信-尾号4151','苏州-工商-尾号0787','苏州-农行-尾号3024','苏州-农业-尾号0822','太原-民生-尾号8389','天津-中信-尾号1344','天津-中信-尾号3784','潍坊-招商-尾号8418','乌鲁木齐-中行-尾号5249','武汉-建行-尾号1275','武汉-农商-尾号0012','武汉-农业-尾号4678','武汉-兴业-尾号5712','西安-中信-尾号8691','西宁-工商-尾号3407','襄阳-中国-尾号5185','新乡-工商-尾号1324','新乡-建设-尾号6120','徐州-农业-尾号0703','许昌-建设-尾号6281','许昌-中原-尾号6730','阳泉-建设-尾号9026','宜昌-建设-尾号6183','榆林-中信-尾号7009','运城-工商-尾号5962','长春-建行-尾号0641','郑州-建设-尾号5173','郑州-建设-尾号6159','郑州-郑州-尾号5186','重庆-农业-尾号7248','周口-中原-尾号8641','全国通用-易宝刷卡-其它','上海-淘宝','郑州-汇付天下','郑州-工商-尾号3594','全国通用-现金','全国通用-中信卡','全国通用-农商-卓越盈佳','文盛-对公支付宝','环优盛文-客来乐-支付宝','环优-拉卡拉','环优盛文-客来乐-微信','环优-中信-尾号3814','京东-对公支付-北京','环优盛文-客来乐-支付宝','环优-拉卡拉','环优盛文-客来乐-微信','环优-中信-尾号3814','优一点-客来乐-支付宝','优一点-客来乐-微信','优一点-新大陆','优一点-民生-5150','全国通用-现金','全国通用-中信卡','全国通用-农商-卓越盈佳','全国通用-易宝刷卡-培训学校','文盛-对公支付宝','上海-淘宝','京东-对公支付-北京')
)
and fc.OrderType in ('06','07','08','09','10','99')
and fc.CreatedOn BETWEEN  '2018-01-01 00:00:00.001' and '2020-10-31 23:59:59.999'  
) a
LEFT JOIN SYS_Branch b WITH (NOLOCK)  on a.OrderOwningCompany = b.BranchId
group by  b.BranchName
ORDER BY num desc
 
-- 求和    264
select sum(num) from (
SELECT b.BranchName ,count(*) num FROM
(select DISTINCT fc.OrderId ,fc.OrderOwningCompany  from FC_Order fc 
where not exists (
	select 1
	from FC_Receipt r 
	join   FC_SalesChargeDetail s  on r.ReceiptGuid = s.ReceiptGuid
	join  SYS_DD dd on  s.PaymentsType = dd.DDCode and dd.DDType = 'PaymentsType'
	where r.orderId = fc.orderId
	and dd.DDName in ('安庆-农业-尾号7373','安阳-邮政-尾号1405','安阳-中信-尾号5411','保定-建设-尾号1949','保定-建设-尾号3500','北京-建设-尾号9353','常州-建设-尾号6103','成都-农业-尾号6268','福州-建设-尾号0027','福州-建设-尾号5348','福州-民生-尾号2732','工行汇款-黄森','工商银行-北京-尾号4517','工商银行-焦作-尾号4943','广州-建设-尾号8637','广州-交通-尾号6875','哈尔滨-建设-尾号2054','杭州-杭州-尾号8950','杭州-招商-尾号9653','合肥-交通-尾号5692','合肥-民生-尾号2096','菏泽-建设-尾号7999','衡阳-工商-尾号9013','济南-建设-尾号9838','济南-民生-尾号1122','济南-农行-尾号4603','济南-农业-尾号9637','济宁-中信-尾号9171','焦作-工行-尾号7987','焦作-建设-尾号0362','荆州-农商-尾号7063','开封-农信-尾号2624','六安-建设-尾号2190','洛阳-交通-尾号7925','南昌-中国-尾号6262','南京-中国-尾号8715','南京-中信-尾号6164','南阳-邮政-尾号9931','平顶山-工商-尾号0007','青岛-工行-尾号6830','青岛-工商-尾号1036','全国通用-易宝刷卡-培训学校','上海-建设-尾号9142','上海-民生-尾号4790','上海-农业-尾号1204','上海-中行-尾号1279','沈阳-建行-尾号0532','沈阳-交通-尾号2406','沈阳-盛京-尾号3390','石家庄-民生-尾号0037','石家庄-民生-尾号6129','石家庄-中信-尾号2265','石家庄-中信-尾号4151','苏州-工商-尾号0787','苏州-农行-尾号3024','苏州-农业-尾号0822','太原-民生-尾号8389','天津-中信-尾号1344','天津-中信-尾号3784','潍坊-招商-尾号8418','乌鲁木齐-中行-尾号5249','武汉-建行-尾号1275','武汉-农商-尾号0012','武汉-农业-尾号4678','武汉-兴业-尾号5712','西安-中信-尾号8691','西宁-工商-尾号3407','襄阳-中国-尾号5185','新乡-工商-尾号1324','新乡-建设-尾号6120','徐州-农业-尾号0703','许昌-建设-尾号6281','许昌-中原-尾号6730','阳泉-建设-尾号9026','宜昌-建设-尾号6183','榆林-中信-尾号7009','运城-工商-尾号5962','长春-建行-尾号0641','郑州-建设-尾号5173','郑州-建设-尾号6159','郑州-郑州-尾号5186','重庆-农业-尾号7248','周口-中原-尾号8641','全国通用-易宝刷卡-其它','上海-淘宝','郑州-汇付天下','郑州-工商-尾号3594','全国通用-现金','全国通用-中信卡','全国通用-农商-卓越盈佳','文盛-对公支付宝','环优盛文-客来乐-支付宝','环优-拉卡拉','环优盛文-客来乐-微信','环优-中信-尾号3814','京东-对公支付-北京','环优盛文-客来乐-支付宝','环优-拉卡拉','环优盛文-客来乐-微信','环优-中信-尾号3814','优一点-客来乐-支付宝','优一点-客来乐-微信','优一点-新大陆','优一点-民生-5150','全国通用-现金','全国通用-中信卡','全国通用-农商-卓越盈佳','全国通用-易宝刷卡-培训学校','文盛-对公支付宝','上海-淘宝','京东-对公支付-北京')
)
and fc.OrderType in ('06','07','08','09','10','99')
and fc.CreatedOn BETWEEN  '2018-01-01 00:00:00.001' and '2020-10-31 23:59:59.999'  
) a
LEFT JOIN SYS_Branch b WITH (NOLOCK)  on a.OrderOwningCompany = b.BranchId
ORDER BY num desc
) a

-- 郑州	56
-- 济南	49
-- 青岛	41
-- 广州	24
-- 长春	17
-- 南京	14
-- 北京医药	10
-- 长沙	9
-- 杭州	8
-- 沈阳	8
-- 上海	6
-- 石家庄	5
-- 天津	4
-- 南宁	2
-- 集团总部	2
-- 荆门	1
-- 六安	1
-- 哈尔滨	1
-- 南通	1
-- 西安	1
-- 厦门	1
-- 徐州	1
-- 苏州	1
-- 重庆	1



-- 各分校迁移前 不符合 迁移规则

-- 有效日期内不符合付款条件的
SELECT b.BranchName ,count(*) num FROM
( select DISTINCT fc.OrderId ,fc.OrderOwningCompany from FC_Order fc  WITH (NOLOCK)
where exists (
	select 1
	from FC_Receipt r 
	join   FC_SalesChargeDetail s  on r.ReceiptGuid = s.ReceiptGuid
	join  SYS_DD dd on  s.PaymentsType = dd.DDCode and dd.DDType = 'PaymentsType'
	where r.orderId = fc.orderId
	and dd.DDName in ('安庆-农业-尾号7373','安阳-邮政-尾号1405','安阳-中信-尾号5411','保定-建设-尾号1949','保定-建设-尾号3500','北京-建设-尾号9353','常州-建设-尾号6103','成都-农业-尾号6268','福州-建设-尾号0027','福州-建设-尾号5348','福州-民生-尾号2732','工行汇款-黄森','工商银行-北京-尾号4517','工商银行-焦作-尾号4943','广州-建设-尾号8637','广州-交通-尾号6875','哈尔滨-建设-尾号2054','杭州-杭州-尾号8950','杭州-招商-尾号9653','合肥-交通-尾号5692','合肥-民生-尾号2096','菏泽-建设-尾号7999','衡阳-工商-尾号9013','济南-建设-尾号9838','济南-民生-尾号1122','济南-农行-尾号4603','济南-农业-尾号9637','济宁-中信-尾号9171','焦作-工行-尾号7987','焦作-建设-尾号0362','荆州-农商-尾号7063','开封-农信-尾号2624','六安-建设-尾号2190','洛阳-交通-尾号7925','南昌-中国-尾号6262','南京-中国-尾号8715','南京-中信-尾号6164','南阳-邮政-尾号9931','平顶山-工商-尾号0007','青岛-工行-尾号6830','青岛-工商-尾号1036','全国通用-易宝刷卡-培训学校','上海-建设-尾号9142','上海-民生-尾号4790','上海-农业-尾号1204','上海-中行-尾号1279','沈阳-建行-尾号0532','沈阳-交通-尾号2406','沈阳-盛京-尾号3390','石家庄-民生-尾号0037','石家庄-民生-尾号6129','石家庄-中信-尾号2265','石家庄-中信-尾号4151','苏州-工商-尾号0787','苏州-农行-尾号3024','苏州-农业-尾号0822','太原-民生-尾号8389','天津-中信-尾号1344','天津-中信-尾号3784','潍坊-招商-尾号8418','乌鲁木齐-中行-尾号5249','武汉-建行-尾号1275','武汉-农商-尾号0012','武汉-农业-尾号4678','武汉-兴业-尾号5712','西安-中信-尾号8691','西宁-工商-尾号3407','襄阳-中国-尾号5185','新乡-工商-尾号1324','新乡-建设-尾号6120','徐州-农业-尾号0703','许昌-建设-尾号6281','许昌-中原-尾号6730','阳泉-建设-尾号9026','宜昌-建设-尾号6183','榆林-中信-尾号7009','运城-工商-尾号5962','长春-建行-尾号0641','郑州-建设-尾号5173','郑州-建设-尾号6159','郑州-郑州-尾号5186','重庆-农业-尾号7248','周口-中原-尾号8641','全国通用-易宝刷卡-其它','上海-淘宝','郑州-汇付天下','郑州-工商-尾号3594','全国通用-现金','全国通用-中信卡','全国通用-农商-卓越盈佳','文盛-对公支付宝','环优盛文-客来乐-支付宝','环优-拉卡拉','环优盛文-客来乐-微信','环优-中信-尾号3814','京东-对公支付-北京','环优盛文-客来乐-支付宝','环优-拉卡拉','环优盛文-客来乐-微信','环优-中信-尾号3814','优一点-客来乐-支付宝','优一点-客来乐-微信','优一点-新大陆','优一点-民生-5150','全国通用-现金','全国通用-中信卡','全国通用-农商-卓越盈佳','全国通用-易宝刷卡-培训学校','文盛-对公支付宝','上海-淘宝','京东-对公支付-北京')
)
and fc.CreatedOn BETWEEN  '2018-01-01 00:00:00.001' and '2020-10-31 23:59:59.999' 
) a
LEFT JOIN SYS_Branch b WITH (NOLOCK)  on a.OrderOwningCompany = b.BranchId
group by  b.BranchName
ORDER BY num desc

-- 求和  8248
select sum(num) from (
SELECT b.BranchName ,count(*) num FROM
( select DISTINCT fc.OrderId ,fc.OrderOwningCompany from FC_Order fc  WITH (NOLOCK)
where exists (
	select 1
	from FC_Receipt r 
	join   FC_SalesChargeDetail s  on r.ReceiptGuid = s.ReceiptGuid
	join  SYS_DD dd on  s.PaymentsType = dd.DDCode and dd.DDType = 'PaymentsType'
	where r.orderId = fc.orderId
	and dd.DDName in ('安庆-农业-尾号7373','安阳-邮政-尾号1405','安阳-中信-尾号5411','保定-建设-尾号1949','保定-建设-尾号3500','北京-建设-尾号9353','常州-建设-尾号6103','成都-农业-尾号6268','福州-建设-尾号0027','福州-建设-尾号5348','福州-民生-尾号2732','工行汇款-黄森','工商银行-北京-尾号4517','工商银行-焦作-尾号4943','广州-建设-尾号8637','广州-交通-尾号6875','哈尔滨-建设-尾号2054','杭州-杭州-尾号8950','杭州-招商-尾号9653','合肥-交通-尾号5692','合肥-民生-尾号2096','菏泽-建设-尾号7999','衡阳-工商-尾号9013','济南-建设-尾号9838','济南-民生-尾号1122','济南-农行-尾号4603','济南-农业-尾号9637','济宁-中信-尾号9171','焦作-工行-尾号7987','焦作-建设-尾号0362','荆州-农商-尾号7063','开封-农信-尾号2624','六安-建设-尾号2190','洛阳-交通-尾号7925','南昌-中国-尾号6262','南京-中国-尾号8715','南京-中信-尾号6164','南阳-邮政-尾号9931','平顶山-工商-尾号0007','青岛-工行-尾号6830','青岛-工商-尾号1036','全国通用-易宝刷卡-培训学校','上海-建设-尾号9142','上海-民生-尾号4790','上海-农业-尾号1204','上海-中行-尾号1279','沈阳-建行-尾号0532','沈阳-交通-尾号2406','沈阳-盛京-尾号3390','石家庄-民生-尾号0037','石家庄-民生-尾号6129','石家庄-中信-尾号2265','石家庄-中信-尾号4151','苏州-工商-尾号0787','苏州-农行-尾号3024','苏州-农业-尾号0822','太原-民生-尾号8389','天津-中信-尾号1344','天津-中信-尾号3784','潍坊-招商-尾号8418','乌鲁木齐-中行-尾号5249','武汉-建行-尾号1275','武汉-农商-尾号0012','武汉-农业-尾号4678','武汉-兴业-尾号5712','西安-中信-尾号8691','西宁-工商-尾号3407','襄阳-中国-尾号5185','新乡-工商-尾号1324','新乡-建设-尾号6120','徐州-农业-尾号0703','许昌-建设-尾号6281','许昌-中原-尾号6730','阳泉-建设-尾号9026','宜昌-建设-尾号6183','榆林-中信-尾号7009','运城-工商-尾号5962','长春-建行-尾号0641','郑州-建设-尾号5173','郑州-建设-尾号6159','郑州-郑州-尾号5186','重庆-农业-尾号7248','周口-中原-尾号8641','全国通用-易宝刷卡-其它','上海-淘宝','郑州-汇付天下','郑州-工商-尾号3594','全国通用-现金','全国通用-中信卡','全国通用-农商-卓越盈佳','文盛-对公支付宝','环优盛文-客来乐-支付宝','环优-拉卡拉','环优盛文-客来乐-微信','环优-中信-尾号3814','京东-对公支付-北京','环优盛文-客来乐-支付宝','环优-拉卡拉','环优盛文-客来乐-微信','环优-中信-尾号3814','优一点-客来乐-支付宝','优一点-客来乐-微信','优一点-新大陆','优一点-民生-5150','全国通用-现金','全国通用-中信卡','全国通用-农商-卓越盈佳','全国通用-易宝刷卡-培训学校','文盛-对公支付宝','上海-淘宝','京东-对公支付-北京')
)
and fc.CreatedOn BETWEEN  '2018-01-01 00:00:00.001' and '2020-10-31 23:59:59.999' 
) a
LEFT JOIN SYS_Branch b WITH (NOLOCK)  on a.OrderOwningCompany = b.BranchId
group by  b.BranchName
) a
-- 北京工程	3174
-- 北京医药	1247
-- 石家庄	635
-- 济南	474
-- 上海	430
-- 杭州	379
-- 郑州	374
-- 南京	334
-- 广州	221
-- 重庆	158
-- 武汉	141
-- 徐州	94
-- 沈阳	71
-- 成都	68
-- 苏州	55
-- 长沙	54
-- 福州	52
-- 合肥	51
-- 保定	37
-- 洛阳	32
-- 天津	21
-- 西安	20
-- 衡阳	19
-- 六安	19
-- 长春	17
-- 攀枝花	13
-- 新乡	6
-- 宁波	5
-- 南宁	5
-- 南昌	4
-- 开封	4
-- 青岛	3
-- 无锡	3
-- 呼和浩特	3
-- 珠海	2
-- 昆明	2
-- 集团总部	2
-- 南充	2
-- 太原	1
-- 济宁	1
-- Crm4测试分校	1
-- 长治	1
-- 金华	1
-- 万州	1
-- 兰州	1
-- 阳泉	1
-- 黄冈	1
-- 邯郸	1
-- 温州	1
-- 宜宾	1
-- 临沂	1
-- 常州	1
-- 平顶山	1
-- 安庆	1
-- 菏泽	1

-- 无效日期所有的
SELECT b.BranchName ,count(*) num FROM
(select  fc.OrderId ,fc.OrderOwningCompany from FC_Order fc 
where  fc.CreatedOn not BETWEEN  '2018-01-01 00:00:00.001' and '2020-10-31 23:59:59.999'  
) a
LEFT JOIN SYS_Branch b WITH (NOLOCK)  on a.OrderOwningCompany = b.BranchId
group by  b.BranchName
ORDER BY num desc
--求和 28929
select sum(num) from (
SELECT b.BranchName ,count(*) num FROM
(select  fc.OrderId ,fc.OrderOwningCompany from FC_Order fc 
where  fc.CreatedOn not BETWEEN  '2018-01-01 00:00:00.001' and '2020-10-31 23:59:59.999'  
) a
LEFT JOIN SYS_Branch b WITH (NOLOCK)  on a.OrderOwningCompany = b.BranchId
group by  b.BranchName
) a
-- 北京医药	5126
-- 石家庄	2863
-- 郑州	2702
-- 济南	2613
-- 上海	2190
-- 广州	1636
-- 南京	1490
-- 集团总部	1419
-- 杭州	1163
-- 北京工程	1089
-- 重庆	880
-- 天津	582
-- 青岛	554
-- 成都	488
-- 沈阳	484
-- 武汉	472
-- 福州	456
-- 徐州	444
-- 苏州	340
-- 长沙	259
-- 合肥	213
-- 西安	211
-- 南宁	211
-- 太原	187
-- 长春	146
-- 洛阳	142
-- 南昌	86
-- 衡阳	70
-- 保定	51
-- 锦州	48
-- 六安	42
-- 安庆	31
-- 邯郸	21
-- 商丘	19
-- 无锡	18
-- 焦作	17
-- 新乡	15
-- 唐山	13
-- 哈尔滨	11
-- 大连	9
-- 开封	8
-- 连云港	8
-- 南通	8
-- 万州	7
-- 厦门	7
-- 南充	7
-- 扬州	7
-- 济宁	6
-- 宜昌	6
-- 宁波	6
-- 安阳	6
-- 平顶山	5
-- 阳泉	4
-- 温州	4
-- 周口	4
-- 优路网校	3
-- 昆明	3
-- 呼和浩特	3
-- 荆州	2
-- 临沂	2
-- 秦皇岛	2
-- 襄阳	1
-- 常州	1
-- 大同	1
-- 张家口	1
-- 宜宾	1
-- 绵阳	1
-- 沧州	1
-- 廊坊	1
-- 烟台	1
-- 许昌	1

-- 正常订单总量   14812
select count(*) from FC_Order fc
where not exists (
	select 1
	from FC_Receipt r 
	join   FC_SalesChargeDetail s  on r.ReceiptGuid = s.ReceiptGuid
	join  SYS_DD dd on  s.PaymentsType = dd.DDCode and dd.DDType = 'PaymentsType'
	where r.orderId = fc.orderId
	and dd.DDName in ('安庆-农业-尾号7373','安阳-邮政-尾号1405','安阳-中信-尾号5411','保定-建设-尾号1949','保定-建设-尾号3500','北京-建设-尾号9353','常州-建设-尾号6103','成都-农业-尾号6268','福州-建设-尾号0027','福州-建设-尾号5348','福州-民生-尾号2732','工行汇款-黄森','工商银行-北京-尾号4517','工商银行-焦作-尾号4943','广州-建设-尾号8637','广州-交通-尾号6875','哈尔滨-建设-尾号2054','杭州-杭州-尾号8950','杭州-招商-尾号9653','合肥-交通-尾号5692','合肥-民生-尾号2096','菏泽-建设-尾号7999','衡阳-工商-尾号9013','济南-建设-尾号9838','济南-民生-尾号1122','济南-农行-尾号4603','济南-农业-尾号9637','济宁-中信-尾号9171','焦作-工行-尾号7987','焦作-建设-尾号0362','荆州-农商-尾号7063','开封-农信-尾号2624','六安-建设-尾号2190','洛阳-交通-尾号7925','南昌-中国-尾号6262','南京-中国-尾号8715','南京-中信-尾号6164','南阳-邮政-尾号9931','平顶山-工商-尾号0007','青岛-工行-尾号6830','青岛-工商-尾号1036','全国通用-易宝刷卡-培训学校','上海-建设-尾号9142','上海-民生-尾号4790','上海-农业-尾号1204','上海-中行-尾号1279','沈阳-建行-尾号0532','沈阳-交通-尾号2406','沈阳-盛京-尾号3390','石家庄-民生-尾号0037','石家庄-民生-尾号6129','石家庄-中信-尾号2265','石家庄-中信-尾号4151','苏州-工商-尾号0787','苏州-农行-尾号3024','苏州-农业-尾号0822','太原-民生-尾号8389','天津-中信-尾号1344','天津-中信-尾号3784','潍坊-招商-尾号8418','乌鲁木齐-中行-尾号5249','武汉-建行-尾号1275','武汉-农商-尾号0012','武汉-农业-尾号4678','武汉-兴业-尾号5712','西安-中信-尾号8691','西宁-工商-尾号3407','襄阳-中国-尾号5185','新乡-工商-尾号1324','新乡-建设-尾号6120','徐州-农业-尾号0703','许昌-建设-尾号6281','许昌-中原-尾号6730','阳泉-建设-尾号9026','宜昌-建设-尾号6183','榆林-中信-尾号7009','运城-工商-尾号5962','长春-建行-尾号0641','郑州-建设-尾号5173','郑州-建设-尾号6159','郑州-郑州-尾号5186','重庆-农业-尾号7248','周口-中原-尾号8641','全国通用-易宝刷卡-其它','上海-淘宝','郑州-汇付天下','郑州-工商-尾号3594','全国通用-现金','全国通用-中信卡','全国通用-农商-卓越盈佳','文盛-对公支付宝','环优盛文-客来乐-支付宝','环优-拉卡拉','环优盛文-客来乐-微信','环优-中信-尾号3814','京东-对公支付-北京','环优盛文-客来乐-支付宝','环优-拉卡拉','环优盛文-客来乐-微信','环优-中信-尾号3814','优一点-客来乐-支付宝','优一点-客来乐-微信','优一点-新大陆','优一点-民生-5150','全国通用-现金','全国通用-中信卡','全国通用-农商-卓越盈佳','全国通用-易宝刷卡-培训学校','文盛-对公支付宝','上海-淘宝','京东-对公支付-北京')
)
and fc.OrderType ='01'
and fc.CreatedOn BETWEEN  '2018-01-01 00:00:00.001' and '2020-10-31 23:59:59.999'  

-- 正常订单覆盖的班级数量  758
select count( DISTINCT ogd.GradeId ) from FC_Order fc
	JOIN FC_OrderGradeDetail ogd WITH (NOLOCK)  ON ogd.OrderId = fc.OrderId
	JOIN SYS_Grade g WITH (NOLOCK)  ON g.GradeId = ogd.GradeId
where not exists (
	select 1
	from FC_Receipt r 
	join   FC_SalesChargeDetail s  on r.ReceiptGuid = s.ReceiptGuid
	join  SYS_DD dd on  s.PaymentsType = dd.DDCode and dd.DDType = 'PaymentsType'
	where r.orderId = fc.orderId
	and dd.DDName in ('安庆-农业-尾号7373','安阳-邮政-尾号1405','安阳-中信-尾号5411','保定-建设-尾号1949','保定-建设-尾号3500','北京-建设-尾号9353','常州-建设-尾号6103','成都-农业-尾号6268','福州-建设-尾号0027','福州-建设-尾号5348','福州-民生-尾号2732','工行汇款-黄森','工商银行-北京-尾号4517','工商银行-焦作-尾号4943','广州-建设-尾号8637','广州-交通-尾号6875','哈尔滨-建设-尾号2054','杭州-杭州-尾号8950','杭州-招商-尾号9653','合肥-交通-尾号5692','合肥-民生-尾号2096','菏泽-建设-尾号7999','衡阳-工商-尾号9013','济南-建设-尾号9838','济南-民生-尾号1122','济南-农行-尾号4603','济南-农业-尾号9637','济宁-中信-尾号9171','焦作-工行-尾号7987','焦作-建设-尾号0362','荆州-农商-尾号7063','开封-农信-尾号2624','六安-建设-尾号2190','洛阳-交通-尾号7925','南昌-中国-尾号6262','南京-中国-尾号8715','南京-中信-尾号6164','南阳-邮政-尾号9931','平顶山-工商-尾号0007','青岛-工行-尾号6830','青岛-工商-尾号1036','全国通用-易宝刷卡-培训学校','上海-建设-尾号9142','上海-民生-尾号4790','上海-农业-尾号1204','上海-中行-尾号1279','沈阳-建行-尾号0532','沈阳-交通-尾号2406','沈阳-盛京-尾号3390','石家庄-民生-尾号0037','石家庄-民生-尾号6129','石家庄-中信-尾号2265','石家庄-中信-尾号4151','苏州-工商-尾号0787','苏州-农行-尾号3024','苏州-农业-尾号0822','太原-民生-尾号8389','天津-中信-尾号1344','天津-中信-尾号3784','潍坊-招商-尾号8418','乌鲁木齐-中行-尾号5249','武汉-建行-尾号1275','武汉-农商-尾号0012','武汉-农业-尾号4678','武汉-兴业-尾号5712','西安-中信-尾号8691','西宁-工商-尾号3407','襄阳-中国-尾号5185','新乡-工商-尾号1324','新乡-建设-尾号6120','徐州-农业-尾号0703','许昌-建设-尾号6281','许昌-中原-尾号6730','阳泉-建设-尾号9026','宜昌-建设-尾号6183','榆林-中信-尾号7009','运城-工商-尾号5962','长春-建行-尾号0641','郑州-建设-尾号5173','郑州-建设-尾号6159','郑州-郑州-尾号5186','重庆-农业-尾号7248','周口-中原-尾号8641','全国通用-易宝刷卡-其它','上海-淘宝','郑州-汇付天下','郑州-工商-尾号3594','全国通用-现金','全国通用-中信卡','全国通用-农商-卓越盈佳','文盛-对公支付宝','环优盛文-客来乐-支付宝','环优-拉卡拉','环优盛文-客来乐-微信','环优-中信-尾号3814','京东-对公支付-北京','环优盛文-客来乐-支付宝','环优-拉卡拉','环优盛文-客来乐-微信','环优-中信-尾号3814','优一点-客来乐-支付宝','优一点-客来乐-微信','优一点-新大陆','优一点-民生-5150','全国通用-现金','全国通用-中信卡','全国通用-农商-卓越盈佳','全国通用-易宝刷卡-培训学校','文盛-对公支付宝','上海-淘宝','京东-对公支付-北京')
)
and fc.OrderType ='01'
and fc.CreatedOn BETWEEN  '2018-01-01 00:00:00.001' and '2020-10-31 23:59:59.999'  


-- 正常订单收据数量  15372

select count(DISTINCT sales.SalesChargeDetailId) from FC_Order fc
Left JOIN  FC_Receipt receipt    on fc.OrderId = receipt.OrderId  
Left JOIN  FC_SalesChargeDetail sales    on receipt.ReceiptGuid = sales.ReceiptGuid
where not exists (
	select 1
	from FC_Receipt r 
	join   FC_SalesChargeDetail s  on r.ReceiptGuid = s.ReceiptGuid
	join  SYS_DD dd on  s.PaymentsType = dd.DDCode and dd.DDType = 'PaymentsType'
	where r.orderId = fc.orderId
	and dd.DDName in ('安庆-农业-尾号7373','安阳-邮政-尾号1405','安阳-中信-尾号5411','保定-建设-尾号1949','保定-建设-尾号3500','北京-建设-尾号9353','常州-建设-尾号6103','成都-农业-尾号6268','福州-建设-尾号0027','福州-建设-尾号5348','福州-民生-尾号2732','工行汇款-黄森','工商银行-北京-尾号4517','工商银行-焦作-尾号4943','广州-建设-尾号8637','广州-交通-尾号6875','哈尔滨-建设-尾号2054','杭州-杭州-尾号8950','杭州-招商-尾号9653','合肥-交通-尾号5692','合肥-民生-尾号2096','菏泽-建设-尾号7999','衡阳-工商-尾号9013','济南-建设-尾号9838','济南-民生-尾号1122','济南-农行-尾号4603','济南-农业-尾号9637','济宁-中信-尾号9171','焦作-工行-尾号7987','焦作-建设-尾号0362','荆州-农商-尾号7063','开封-农信-尾号2624','六安-建设-尾号2190','洛阳-交通-尾号7925','南昌-中国-尾号6262','南京-中国-尾号8715','南京-中信-尾号6164','南阳-邮政-尾号9931','平顶山-工商-尾号0007','青岛-工行-尾号6830','青岛-工商-尾号1036','全国通用-易宝刷卡-培训学校','上海-建设-尾号9142','上海-民生-尾号4790','上海-农业-尾号1204','上海-中行-尾号1279','沈阳-建行-尾号0532','沈阳-交通-尾号2406','沈阳-盛京-尾号3390','石家庄-民生-尾号0037','石家庄-民生-尾号6129','石家庄-中信-尾号2265','石家庄-中信-尾号4151','苏州-工商-尾号0787','苏州-农行-尾号3024','苏州-农业-尾号0822','太原-民生-尾号8389','天津-中信-尾号1344','天津-中信-尾号3784','潍坊-招商-尾号8418','乌鲁木齐-中行-尾号5249','武汉-建行-尾号1275','武汉-农商-尾号0012','武汉-农业-尾号4678','武汉-兴业-尾号5712','西安-中信-尾号8691','西宁-工商-尾号3407','襄阳-中国-尾号5185','新乡-工商-尾号1324','新乡-建设-尾号6120','徐州-农业-尾号0703','许昌-建设-尾号6281','许昌-中原-尾号6730','阳泉-建设-尾号9026','宜昌-建设-尾号6183','榆林-中信-尾号7009','运城-工商-尾号5962','长春-建行-尾号0641','郑州-建设-尾号5173','郑州-建设-尾号6159','郑州-郑州-尾号5186','重庆-农业-尾号7248','周口-中原-尾号8641','全国通用-易宝刷卡-其它','上海-淘宝','郑州-汇付天下','郑州-工商-尾号3594','全国通用-现金','全国通用-中信卡','全国通用-农商-卓越盈佳','文盛-对公支付宝','环优盛文-客来乐-支付宝','环优-拉卡拉','环优盛文-客来乐-微信','环优-中信-尾号3814','京东-对公支付-北京','环优盛文-客来乐-支付宝','环优-拉卡拉','环优盛文-客来乐-微信','环优-中信-尾号3814','优一点-客来乐-支付宝','优一点-客来乐-微信','优一点-新大陆','优一点-民生-5150','全国通用-现金','全国通用-中信卡','全国通用-农商-卓越盈佳','全国通用-易宝刷卡-培训学校','文盛-对公支付宝','上海-淘宝','京东-对公支付-北京')
)
and fc.OrderType ='01'
and fc.CreatedOn BETWEEN  '2018-01-01 00:00:00.001' and '2020-10-31 23:59:59.999'  



-- 重读总量   2542
select count(*) from FC_Order fc
where not exists (
	select 1
	from FC_Receipt r 
	join   FC_SalesChargeDetail s  on r.ReceiptGuid = s.ReceiptGuid
	join  SYS_DD dd on  s.PaymentsType = dd.DDCode and dd.DDType = 'PaymentsType'
	where r.orderId = fc.orderId
	and dd.DDName in ('安庆-农业-尾号7373','安阳-邮政-尾号1405','安阳-中信-尾号5411','保定-建设-尾号1949','保定-建设-尾号3500','北京-建设-尾号9353','常州-建设-尾号6103','成都-农业-尾号6268','福州-建设-尾号0027','福州-建设-尾号5348','福州-民生-尾号2732','工行汇款-黄森','工商银行-北京-尾号4517','工商银行-焦作-尾号4943','广州-建设-尾号8637','广州-交通-尾号6875','哈尔滨-建设-尾号2054','杭州-杭州-尾号8950','杭州-招商-尾号9653','合肥-交通-尾号5692','合肥-民生-尾号2096','菏泽-建设-尾号7999','衡阳-工商-尾号9013','济南-建设-尾号9838','济南-民生-尾号1122','济南-农行-尾号4603','济南-农业-尾号9637','济宁-中信-尾号9171','焦作-工行-尾号7987','焦作-建设-尾号0362','荆州-农商-尾号7063','开封-农信-尾号2624','六安-建设-尾号2190','洛阳-交通-尾号7925','南昌-中国-尾号6262','南京-中国-尾号8715','南京-中信-尾号6164','南阳-邮政-尾号9931','平顶山-工商-尾号0007','青岛-工行-尾号6830','青岛-工商-尾号1036','全国通用-易宝刷卡-培训学校','上海-建设-尾号9142','上海-民生-尾号4790','上海-农业-尾号1204','上海-中行-尾号1279','沈阳-建行-尾号0532','沈阳-交通-尾号2406','沈阳-盛京-尾号3390','石家庄-民生-尾号0037','石家庄-民生-尾号6129','石家庄-中信-尾号2265','石家庄-中信-尾号4151','苏州-工商-尾号0787','苏州-农行-尾号3024','苏州-农业-尾号0822','太原-民生-尾号8389','天津-中信-尾号1344','天津-中信-尾号3784','潍坊-招商-尾号8418','乌鲁木齐-中行-尾号5249','武汉-建行-尾号1275','武汉-农商-尾号0012','武汉-农业-尾号4678','武汉-兴业-尾号5712','西安-中信-尾号8691','西宁-工商-尾号3407','襄阳-中国-尾号5185','新乡-工商-尾号1324','新乡-建设-尾号6120','徐州-农业-尾号0703','许昌-建设-尾号6281','许昌-中原-尾号6730','阳泉-建设-尾号9026','宜昌-建设-尾号6183','榆林-中信-尾号7009','运城-工商-尾号5962','长春-建行-尾号0641','郑州-建设-尾号5173','郑州-建设-尾号6159','郑州-郑州-尾号5186','重庆-农业-尾号7248','周口-中原-尾号8641','全国通用-易宝刷卡-其它','上海-淘宝','郑州-汇付天下','郑州-工商-尾号3594','全国通用-现金','全国通用-中信卡','全国通用-农商-卓越盈佳','文盛-对公支付宝','环优盛文-客来乐-支付宝','环优-拉卡拉','环优盛文-客来乐-微信','环优-中信-尾号3814','京东-对公支付-北京','环优盛文-客来乐-支付宝','环优-拉卡拉','环优盛文-客来乐-微信','环优-中信-尾号3814','优一点-客来乐-支付宝','优一点-客来乐-微信','优一点-新大陆','优一点-民生-5150','全国通用-现金','全国通用-中信卡','全国通用-农商-卓越盈佳','全国通用-易宝刷卡-培训学校','文盛-对公支付宝','上海-淘宝','京东-对公支付-北京')
)
and fc.OrderType ='02'
and fc.CreatedOn BETWEEN  '2018-01-01 00:00:00.001' and '2020-10-31 23:59:59.999'  

-- 重读订单覆盖的班级数量  345
select count( DISTINCT ogd.GradeId ) from FC_Order fc
	JOIN FC_OrderGradeDetail ogd WITH (NOLOCK)  ON ogd.OrderId = fc.OrderId
	JOIN SYS_Grade g WITH (NOLOCK)  ON g.GradeId = ogd.GradeId
where not exists (
	select 1
	from FC_Receipt r 
	join   FC_SalesChargeDetail s  on r.ReceiptGuid = s.ReceiptGuid
	join  SYS_DD dd on  s.PaymentsType = dd.DDCode and dd.DDType = 'PaymentsType'
	where r.orderId = fc.orderId
	and dd.DDName in ('安庆-农业-尾号7373','安阳-邮政-尾号1405','安阳-中信-尾号5411','保定-建设-尾号1949','保定-建设-尾号3500','北京-建设-尾号9353','常州-建设-尾号6103','成都-农业-尾号6268','福州-建设-尾号0027','福州-建设-尾号5348','福州-民生-尾号2732','工行汇款-黄森','工商银行-北京-尾号4517','工商银行-焦作-尾号4943','广州-建设-尾号8637','广州-交通-尾号6875','哈尔滨-建设-尾号2054','杭州-杭州-尾号8950','杭州-招商-尾号9653','合肥-交通-尾号5692','合肥-民生-尾号2096','菏泽-建设-尾号7999','衡阳-工商-尾号9013','济南-建设-尾号9838','济南-民生-尾号1122','济南-农行-尾号4603','济南-农业-尾号9637','济宁-中信-尾号9171','焦作-工行-尾号7987','焦作-建设-尾号0362','荆州-农商-尾号7063','开封-农信-尾号2624','六安-建设-尾号2190','洛阳-交通-尾号7925','南昌-中国-尾号6262','南京-中国-尾号8715','南京-中信-尾号6164','南阳-邮政-尾号9931','平顶山-工商-尾号0007','青岛-工行-尾号6830','青岛-工商-尾号1036','全国通用-易宝刷卡-培训学校','上海-建设-尾号9142','上海-民生-尾号4790','上海-农业-尾号1204','上海-中行-尾号1279','沈阳-建行-尾号0532','沈阳-交通-尾号2406','沈阳-盛京-尾号3390','石家庄-民生-尾号0037','石家庄-民生-尾号6129','石家庄-中信-尾号2265','石家庄-中信-尾号4151','苏州-工商-尾号0787','苏州-农行-尾号3024','苏州-农业-尾号0822','太原-民生-尾号8389','天津-中信-尾号1344','天津-中信-尾号3784','潍坊-招商-尾号8418','乌鲁木齐-中行-尾号5249','武汉-建行-尾号1275','武汉-农商-尾号0012','武汉-农业-尾号4678','武汉-兴业-尾号5712','西安-中信-尾号8691','西宁-工商-尾号3407','襄阳-中国-尾号5185','新乡-工商-尾号1324','新乡-建设-尾号6120','徐州-农业-尾号0703','许昌-建设-尾号6281','许昌-中原-尾号6730','阳泉-建设-尾号9026','宜昌-建设-尾号6183','榆林-中信-尾号7009','运城-工商-尾号5962','长春-建行-尾号0641','郑州-建设-尾号5173','郑州-建设-尾号6159','郑州-郑州-尾号5186','重庆-农业-尾号7248','周口-中原-尾号8641','全国通用-易宝刷卡-其它','上海-淘宝','郑州-汇付天下','郑州-工商-尾号3594','全国通用-现金','全国通用-中信卡','全国通用-农商-卓越盈佳','文盛-对公支付宝','环优盛文-客来乐-支付宝','环优-拉卡拉','环优盛文-客来乐-微信','环优-中信-尾号3814','京东-对公支付-北京','环优盛文-客来乐-支付宝','环优-拉卡拉','环优盛文-客来乐-微信','环优-中信-尾号3814','优一点-客来乐-支付宝','优一点-客来乐-微信','优一点-新大陆','优一点-民生-5150','全国通用-现金','全国通用-中信卡','全国通用-农商-卓越盈佳','全国通用-易宝刷卡-培训学校','文盛-对公支付宝','上海-淘宝','京东-对公支付-北京')
)
and fc.OrderType ='02'
and fc.CreatedOn BETWEEN  '2018-01-01 00:00:00.001' and '2020-10-31 23:59:59.999'  


-- 重读订单收据数量  2532
select count(DISTINCT sales.SalesChargeDetailId) from FC_Order fc
Left JOIN  FC_Receipt receipt    on fc.OrderId = receipt.OrderId  
Left JOIN  FC_SalesChargeDetail sales    on receipt.ReceiptGuid = sales.ReceiptGuid
where not exists (
	select 1
	from FC_Receipt r 
	join   FC_SalesChargeDetail s  on r.ReceiptGuid = s.ReceiptGuid
	join  SYS_DD dd on  s.PaymentsType = dd.DDCode and dd.DDType = 'PaymentsType'
	where r.orderId = fc.orderId
	and dd.DDName in ('安庆-农业-尾号7373','安阳-邮政-尾号1405','安阳-中信-尾号5411','保定-建设-尾号1949','保定-建设-尾号3500','北京-建设-尾号9353','常州-建设-尾号6103','成都-农业-尾号6268','福州-建设-尾号0027','福州-建设-尾号5348','福州-民生-尾号2732','工行汇款-黄森','工商银行-北京-尾号4517','工商银行-焦作-尾号4943','广州-建设-尾号8637','广州-交通-尾号6875','哈尔滨-建设-尾号2054','杭州-杭州-尾号8950','杭州-招商-尾号9653','合肥-交通-尾号5692','合肥-民生-尾号2096','菏泽-建设-尾号7999','衡阳-工商-尾号9013','济南-建设-尾号9838','济南-民生-尾号1122','济南-农行-尾号4603','济南-农业-尾号9637','济宁-中信-尾号9171','焦作-工行-尾号7987','焦作-建设-尾号0362','荆州-农商-尾号7063','开封-农信-尾号2624','六安-建设-尾号2190','洛阳-交通-尾号7925','南昌-中国-尾号6262','南京-中国-尾号8715','南京-中信-尾号6164','南阳-邮政-尾号9931','平顶山-工商-尾号0007','青岛-工行-尾号6830','青岛-工商-尾号1036','全国通用-易宝刷卡-培训学校','上海-建设-尾号9142','上海-民生-尾号4790','上海-农业-尾号1204','上海-中行-尾号1279','沈阳-建行-尾号0532','沈阳-交通-尾号2406','沈阳-盛京-尾号3390','石家庄-民生-尾号0037','石家庄-民生-尾号6129','石家庄-中信-尾号2265','石家庄-中信-尾号4151','苏州-工商-尾号0787','苏州-农行-尾号3024','苏州-农业-尾号0822','太原-民生-尾号8389','天津-中信-尾号1344','天津-中信-尾号3784','潍坊-招商-尾号8418','乌鲁木齐-中行-尾号5249','武汉-建行-尾号1275','武汉-农商-尾号0012','武汉-农业-尾号4678','武汉-兴业-尾号5712','西安-中信-尾号8691','西宁-工商-尾号3407','襄阳-中国-尾号5185','新乡-工商-尾号1324','新乡-建设-尾号6120','徐州-农业-尾号0703','许昌-建设-尾号6281','许昌-中原-尾号6730','阳泉-建设-尾号9026','宜昌-建设-尾号6183','榆林-中信-尾号7009','运城-工商-尾号5962','长春-建行-尾号0641','郑州-建设-尾号5173','郑州-建设-尾号6159','郑州-郑州-尾号5186','重庆-农业-尾号7248','周口-中原-尾号8641','全国通用-易宝刷卡-其它','上海-淘宝','郑州-汇付天下','郑州-工商-尾号3594','全国通用-现金','全国通用-中信卡','全国通用-农商-卓越盈佳','文盛-对公支付宝','环优盛文-客来乐-支付宝','环优-拉卡拉','环优盛文-客来乐-微信','环优-中信-尾号3814','京东-对公支付-北京','环优盛文-客来乐-支付宝','环优-拉卡拉','环优盛文-客来乐-微信','环优-中信-尾号3814','优一点-客来乐-支付宝','优一点-客来乐-微信','优一点-新大陆','优一点-民生-5150','全国通用-现金','全国通用-中信卡','全国通用-农商-卓越盈佳','全国通用-易宝刷卡-培训学校','文盛-对公支付宝','上海-淘宝','京东-对公支付-北京')
)
and fc.OrderType ='02'
and fc.CreatedOn BETWEEN  '2018-01-01 00:00:00.001' and '2020-10-31 23:59:59.999'  





-- 转班总量   739
select count(*) from FC_Order fc
where not exists (
	select 1
	from FC_Receipt r 
	join   FC_SalesChargeDetail s  on r.ReceiptGuid = s.ReceiptGuid
	join  SYS_DD dd on  s.PaymentsType = dd.DDCode and dd.DDType = 'PaymentsType'
	where r.orderId = fc.orderId
	and dd.DDName in ('安庆-农业-尾号7373','安阳-邮政-尾号1405','安阳-中信-尾号5411','保定-建设-尾号1949','保定-建设-尾号3500','北京-建设-尾号9353','常州-建设-尾号6103','成都-农业-尾号6268','福州-建设-尾号0027','福州-建设-尾号5348','福州-民生-尾号2732','工行汇款-黄森','工商银行-北京-尾号4517','工商银行-焦作-尾号4943','广州-建设-尾号8637','广州-交通-尾号6875','哈尔滨-建设-尾号2054','杭州-杭州-尾号8950','杭州-招商-尾号9653','合肥-交通-尾号5692','合肥-民生-尾号2096','菏泽-建设-尾号7999','衡阳-工商-尾号9013','济南-建设-尾号9838','济南-民生-尾号1122','济南-农行-尾号4603','济南-农业-尾号9637','济宁-中信-尾号9171','焦作-工行-尾号7987','焦作-建设-尾号0362','荆州-农商-尾号7063','开封-农信-尾号2624','六安-建设-尾号2190','洛阳-交通-尾号7925','南昌-中国-尾号6262','南京-中国-尾号8715','南京-中信-尾号6164','南阳-邮政-尾号9931','平顶山-工商-尾号0007','青岛-工行-尾号6830','青岛-工商-尾号1036','全国通用-易宝刷卡-培训学校','上海-建设-尾号9142','上海-民生-尾号4790','上海-农业-尾号1204','上海-中行-尾号1279','沈阳-建行-尾号0532','沈阳-交通-尾号2406','沈阳-盛京-尾号3390','石家庄-民生-尾号0037','石家庄-民生-尾号6129','石家庄-中信-尾号2265','石家庄-中信-尾号4151','苏州-工商-尾号0787','苏州-农行-尾号3024','苏州-农业-尾号0822','太原-民生-尾号8389','天津-中信-尾号1344','天津-中信-尾号3784','潍坊-招商-尾号8418','乌鲁木齐-中行-尾号5249','武汉-建行-尾号1275','武汉-农商-尾号0012','武汉-农业-尾号4678','武汉-兴业-尾号5712','西安-中信-尾号8691','西宁-工商-尾号3407','襄阳-中国-尾号5185','新乡-工商-尾号1324','新乡-建设-尾号6120','徐州-农业-尾号0703','许昌-建设-尾号6281','许昌-中原-尾号6730','阳泉-建设-尾号9026','宜昌-建设-尾号6183','榆林-中信-尾号7009','运城-工商-尾号5962','长春-建行-尾号0641','郑州-建设-尾号5173','郑州-建设-尾号6159','郑州-郑州-尾号5186','重庆-农业-尾号7248','周口-中原-尾号8641','全国通用-易宝刷卡-其它','上海-淘宝','郑州-汇付天下','郑州-工商-尾号3594','全国通用-现金','全国通用-中信卡','全国通用-农商-卓越盈佳','文盛-对公支付宝','环优盛文-客来乐-支付宝','环优-拉卡拉','环优盛文-客来乐-微信','环优-中信-尾号3814','京东-对公支付-北京','环优盛文-客来乐-支付宝','环优-拉卡拉','环优盛文-客来乐-微信','环优-中信-尾号3814','优一点-客来乐-支付宝','优一点-客来乐-微信','优一点-新大陆','优一点-民生-5150','全国通用-现金','全国通用-中信卡','全国通用-农商-卓越盈佳','全国通用-易宝刷卡-培训学校','文盛-对公支付宝','上海-淘宝','京东-对公支付-北京')
)
and fc.OrderType ='03'
and fc.CreatedOn BETWEEN  '2018-01-01 00:00:00.001' and '2020-10-31 23:59:59.999'  

-- 转班订单覆盖的班级数量  481
select count( DISTINCT ogd.GradeId ) from FC_Order fc
	JOIN FC_OrderGradeDetail ogd WITH (NOLOCK)  ON ogd.OrderId = fc.OrderId
	JOIN SYS_Grade g WITH (NOLOCK)  ON g.GradeId = ogd.GradeId
where not exists (
	select 1
	from FC_Receipt r 
	join   FC_SalesChargeDetail s  on r.ReceiptGuid = s.ReceiptGuid
	join  SYS_DD dd on  s.PaymentsType = dd.DDCode and dd.DDType = 'PaymentsType'
	where r.orderId = fc.orderId
	and dd.DDName in ('安庆-农业-尾号7373','安阳-邮政-尾号1405','安阳-中信-尾号5411','保定-建设-尾号1949','保定-建设-尾号3500','北京-建设-尾号9353','常州-建设-尾号6103','成都-农业-尾号6268','福州-建设-尾号0027','福州-建设-尾号5348','福州-民生-尾号2732','工行汇款-黄森','工商银行-北京-尾号4517','工商银行-焦作-尾号4943','广州-建设-尾号8637','广州-交通-尾号6875','哈尔滨-建设-尾号2054','杭州-杭州-尾号8950','杭州-招商-尾号9653','合肥-交通-尾号5692','合肥-民生-尾号2096','菏泽-建设-尾号7999','衡阳-工商-尾号9013','济南-建设-尾号9838','济南-民生-尾号1122','济南-农行-尾号4603','济南-农业-尾号9637','济宁-中信-尾号9171','焦作-工行-尾号7987','焦作-建设-尾号0362','荆州-农商-尾号7063','开封-农信-尾号2624','六安-建设-尾号2190','洛阳-交通-尾号7925','南昌-中国-尾号6262','南京-中国-尾号8715','南京-中信-尾号6164','南阳-邮政-尾号9931','平顶山-工商-尾号0007','青岛-工行-尾号6830','青岛-工商-尾号1036','全国通用-易宝刷卡-培训学校','上海-建设-尾号9142','上海-民生-尾号4790','上海-农业-尾号1204','上海-中行-尾号1279','沈阳-建行-尾号0532','沈阳-交通-尾号2406','沈阳-盛京-尾号3390','石家庄-民生-尾号0037','石家庄-民生-尾号6129','石家庄-中信-尾号2265','石家庄-中信-尾号4151','苏州-工商-尾号0787','苏州-农行-尾号3024','苏州-农业-尾号0822','太原-民生-尾号8389','天津-中信-尾号1344','天津-中信-尾号3784','潍坊-招商-尾号8418','乌鲁木齐-中行-尾号5249','武汉-建行-尾号1275','武汉-农商-尾号0012','武汉-农业-尾号4678','武汉-兴业-尾号5712','西安-中信-尾号8691','西宁-工商-尾号3407','襄阳-中国-尾号5185','新乡-工商-尾号1324','新乡-建设-尾号6120','徐州-农业-尾号0703','许昌-建设-尾号6281','许昌-中原-尾号6730','阳泉-建设-尾号9026','宜昌-建设-尾号6183','榆林-中信-尾号7009','运城-工商-尾号5962','长春-建行-尾号0641','郑州-建设-尾号5173','郑州-建设-尾号6159','郑州-郑州-尾号5186','重庆-农业-尾号7248','周口-中原-尾号8641','全国通用-易宝刷卡-其它','上海-淘宝','郑州-汇付天下','郑州-工商-尾号3594','全国通用-现金','全国通用-中信卡','全国通用-农商-卓越盈佳','文盛-对公支付宝','环优盛文-客来乐-支付宝','环优-拉卡拉','环优盛文-客来乐-微信','环优-中信-尾号3814','京东-对公支付-北京','环优盛文-客来乐-支付宝','环优-拉卡拉','环优盛文-客来乐-微信','环优-中信-尾号3814','优一点-客来乐-支付宝','优一点-客来乐-微信','优一点-新大陆','优一点-民生-5150','全国通用-现金','全国通用-中信卡','全国通用-农商-卓越盈佳','全国通用-易宝刷卡-培训学校','文盛-对公支付宝','上海-淘宝','京东-对公支付-北京')
)
and fc.OrderType ='03'
and fc.CreatedOn BETWEEN  '2018-01-01 00:00:00.001' and '2020-10-31 23:59:59.999'  


-- 转班订单收据数量  2074
select count(DISTINCT sales.SalesChargeDetailId) from FC_Order fc
Left JOIN  FC_Receipt receipt    on fc.OrderId = receipt.OrderId  
Left JOIN  FC_SalesChargeDetail sales    on receipt.ReceiptGuid = sales.ReceiptGuid
where not exists (
	select 1
	from FC_Receipt r 
	join   FC_SalesChargeDetail s  on r.ReceiptGuid = s.ReceiptGuid
	join  SYS_DD dd on  s.PaymentsType = dd.DDCode and dd.DDType = 'PaymentsType'
	where r.orderId = fc.orderId
	and dd.DDName in ('安庆-农业-尾号7373','安阳-邮政-尾号1405','安阳-中信-尾号5411','保定-建设-尾号1949','保定-建设-尾号3500','北京-建设-尾号9353','常州-建设-尾号6103','成都-农业-尾号6268','福州-建设-尾号0027','福州-建设-尾号5348','福州-民生-尾号2732','工行汇款-黄森','工商银行-北京-尾号4517','工商银行-焦作-尾号4943','广州-建设-尾号8637','广州-交通-尾号6875','哈尔滨-建设-尾号2054','杭州-杭州-尾号8950','杭州-招商-尾号9653','合肥-交通-尾号5692','合肥-民生-尾号2096','菏泽-建设-尾号7999','衡阳-工商-尾号9013','济南-建设-尾号9838','济南-民生-尾号1122','济南-农行-尾号4603','济南-农业-尾号9637','济宁-中信-尾号9171','焦作-工行-尾号7987','焦作-建设-尾号0362','荆州-农商-尾号7063','开封-农信-尾号2624','六安-建设-尾号2190','洛阳-交通-尾号7925','南昌-中国-尾号6262','南京-中国-尾号8715','南京-中信-尾号6164','南阳-邮政-尾号9931','平顶山-工商-尾号0007','青岛-工行-尾号6830','青岛-工商-尾号1036','全国通用-易宝刷卡-培训学校','上海-建设-尾号9142','上海-民生-尾号4790','上海-农业-尾号1204','上海-中行-尾号1279','沈阳-建行-尾号0532','沈阳-交通-尾号2406','沈阳-盛京-尾号3390','石家庄-民生-尾号0037','石家庄-民生-尾号6129','石家庄-中信-尾号2265','石家庄-中信-尾号4151','苏州-工商-尾号0787','苏州-农行-尾号3024','苏州-农业-尾号0822','太原-民生-尾号8389','天津-中信-尾号1344','天津-中信-尾号3784','潍坊-招商-尾号8418','乌鲁木齐-中行-尾号5249','武汉-建行-尾号1275','武汉-农商-尾号0012','武汉-农业-尾号4678','武汉-兴业-尾号5712','西安-中信-尾号8691','西宁-工商-尾号3407','襄阳-中国-尾号5185','新乡-工商-尾号1324','新乡-建设-尾号6120','徐州-农业-尾号0703','许昌-建设-尾号6281','许昌-中原-尾号6730','阳泉-建设-尾号9026','宜昌-建设-尾号6183','榆林-中信-尾号7009','运城-工商-尾号5962','长春-建行-尾号0641','郑州-建设-尾号5173','郑州-建设-尾号6159','郑州-郑州-尾号5186','重庆-农业-尾号7248','周口-中原-尾号8641','全国通用-易宝刷卡-其它','上海-淘宝','郑州-汇付天下','郑州-工商-尾号3594','全国通用-现金','全国通用-中信卡','全国通用-农商-卓越盈佳','文盛-对公支付宝','环优盛文-客来乐-支付宝','环优-拉卡拉','环优盛文-客来乐-微信','环优-中信-尾号3814','京东-对公支付-北京','环优盛文-客来乐-支付宝','环优-拉卡拉','环优盛文-客来乐-微信','环优-中信-尾号3814','优一点-客来乐-支付宝','优一点-客来乐-微信','优一点-新大陆','优一点-民生-5150','全国通用-现金','全国通用-中信卡','全国通用-农商-卓越盈佳','全国通用-易宝刷卡-培训学校','文盛-对公支付宝','上海-淘宝','京东-对公支付-北京')
)
and fc.OrderType ='03'
and fc.CreatedOn BETWEEN  '2018-01-01 00:00:00.001' and '2020-10-31 23:59:59.999'  





-- 各个类型覆盖班级的数量
select count( DISTINCT ogd.GradeId ) 正常 from FC_Order fc
	JOIN FC_OrderGradeDetail ogd WITH (NOLOCK)  ON ogd.OrderId = fc.OrderId
	JOIN SYS_Grade g WITH (NOLOCK)  ON g.GradeId = ogd.GradeId
where not exists (
	select 1
	from FC_Receipt r 
	join   FC_SalesChargeDetail s  on r.ReceiptGuid = s.ReceiptGuid
	join  SYS_DD dd on  s.PaymentsType = dd.DDCode and dd.DDType = 'PaymentsType'
	where r.orderId = fc.orderId
	and dd.DDName in ('安庆-农业-尾号7373','安阳-邮政-尾号1405','安阳-中信-尾号5411','保定-建设-尾号1949','保定-建设-尾号3500','北京-建设-尾号9353','常州-建设-尾号6103','成都-农业-尾号6268','福州-建设-尾号0027','福州-建设-尾号5348','福州-民生-尾号2732','工行汇款-黄森','工商银行-北京-尾号4517','工商银行-焦作-尾号4943','广州-建设-尾号8637','广州-交通-尾号6875','哈尔滨-建设-尾号2054','杭州-杭州-尾号8950','杭州-招商-尾号9653','合肥-交通-尾号5692','合肥-民生-尾号2096','菏泽-建设-尾号7999','衡阳-工商-尾号9013','济南-建设-尾号9838','济南-民生-尾号1122','济南-农行-尾号4603','济南-农业-尾号9637','济宁-中信-尾号9171','焦作-工行-尾号7987','焦作-建设-尾号0362','荆州-农商-尾号7063','开封-农信-尾号2624','六安-建设-尾号2190','洛阳-交通-尾号7925','南昌-中国-尾号6262','南京-中国-尾号8715','南京-中信-尾号6164','南阳-邮政-尾号9931','平顶山-工商-尾号0007','青岛-工行-尾号6830','青岛-工商-尾号1036','全国通用-易宝刷卡-培训学校','上海-建设-尾号9142','上海-民生-尾号4790','上海-农业-尾号1204','上海-中行-尾号1279','沈阳-建行-尾号0532','沈阳-交通-尾号2406','沈阳-盛京-尾号3390','石家庄-民生-尾号0037','石家庄-民生-尾号6129','石家庄-中信-尾号2265','石家庄-中信-尾号4151','苏州-工商-尾号0787','苏州-农行-尾号3024','苏州-农业-尾号0822','太原-民生-尾号8389','天津-中信-尾号1344','天津-中信-尾号3784','潍坊-招商-尾号8418','乌鲁木齐-中行-尾号5249','武汉-建行-尾号1275','武汉-农商-尾号0012','武汉-农业-尾号4678','武汉-兴业-尾号5712','西安-中信-尾号8691','西宁-工商-尾号3407','襄阳-中国-尾号5185','新乡-工商-尾号1324','新乡-建设-尾号6120','徐州-农业-尾号0703','许昌-建设-尾号6281','许昌-中原-尾号6730','阳泉-建设-尾号9026','宜昌-建设-尾号6183','榆林-中信-尾号7009','运城-工商-尾号5962','长春-建行-尾号0641','郑州-建设-尾号5173','郑州-建设-尾号6159','郑州-郑州-尾号5186','重庆-农业-尾号7248','周口-中原-尾号8641','全国通用-易宝刷卡-其它','上海-淘宝','郑州-汇付天下','郑州-工商-尾号3594','全国通用-现金','全国通用-中信卡','全国通用-农商-卓越盈佳','文盛-对公支付宝','环优盛文-客来乐-支付宝','环优-拉卡拉','环优盛文-客来乐-微信','环优-中信-尾号3814','京东-对公支付-北京','环优盛文-客来乐-支付宝','环优-拉卡拉','环优盛文-客来乐-微信','环优-中信-尾号3814','优一点-客来乐-支付宝','优一点-客来乐-微信','优一点-新大陆','优一点-民生-5150','全国通用-现金','全国通用-中信卡','全国通用-农商-卓越盈佳','全国通用-易宝刷卡-培训学校','文盛-对公支付宝','上海-淘宝','京东-对公支付-北京')
)
and fc.OrderType ='01'
and fc.CreatedOn BETWEEN  '2018-01-01 00:00:00.001' and '2020-10-31 23:59:59.999'  ;

select count( DISTINCT ogd.GradeId ) 重读 from FC_Order fc
	JOIN FC_OrderGradeDetail ogd WITH (NOLOCK)  ON ogd.OrderId = fc.OrderId
	JOIN SYS_Grade g WITH (NOLOCK)  ON g.GradeId = ogd.GradeId
where not exists (
	select 1
	from FC_Receipt r 
	join   FC_SalesChargeDetail s  on r.ReceiptGuid = s.ReceiptGuid
	join  SYS_DD dd on  s.PaymentsType = dd.DDCode and dd.DDType = 'PaymentsType'
	where r.orderId = fc.orderId
	and dd.DDName in ('安庆-农业-尾号7373','安阳-邮政-尾号1405','安阳-中信-尾号5411','保定-建设-尾号1949','保定-建设-尾号3500','北京-建设-尾号9353','常州-建设-尾号6103','成都-农业-尾号6268','福州-建设-尾号0027','福州-建设-尾号5348','福州-民生-尾号2732','工行汇款-黄森','工商银行-北京-尾号4517','工商银行-焦作-尾号4943','广州-建设-尾号8637','广州-交通-尾号6875','哈尔滨-建设-尾号2054','杭州-杭州-尾号8950','杭州-招商-尾号9653','合肥-交通-尾号5692','合肥-民生-尾号2096','菏泽-建设-尾号7999','衡阳-工商-尾号9013','济南-建设-尾号9838','济南-民生-尾号1122','济南-农行-尾号4603','济南-农业-尾号9637','济宁-中信-尾号9171','焦作-工行-尾号7987','焦作-建设-尾号0362','荆州-农商-尾号7063','开封-农信-尾号2624','六安-建设-尾号2190','洛阳-交通-尾号7925','南昌-中国-尾号6262','南京-中国-尾号8715','南京-中信-尾号6164','南阳-邮政-尾号9931','平顶山-工商-尾号0007','青岛-工行-尾号6830','青岛-工商-尾号1036','全国通用-易宝刷卡-培训学校','上海-建设-尾号9142','上海-民生-尾号4790','上海-农业-尾号1204','上海-中行-尾号1279','沈阳-建行-尾号0532','沈阳-交通-尾号2406','沈阳-盛京-尾号3390','石家庄-民生-尾号0037','石家庄-民生-尾号6129','石家庄-中信-尾号2265','石家庄-中信-尾号4151','苏州-工商-尾号0787','苏州-农行-尾号3024','苏州-农业-尾号0822','太原-民生-尾号8389','天津-中信-尾号1344','天津-中信-尾号3784','潍坊-招商-尾号8418','乌鲁木齐-中行-尾号5249','武汉-建行-尾号1275','武汉-农商-尾号0012','武汉-农业-尾号4678','武汉-兴业-尾号5712','西安-中信-尾号8691','西宁-工商-尾号3407','襄阳-中国-尾号5185','新乡-工商-尾号1324','新乡-建设-尾号6120','徐州-农业-尾号0703','许昌-建设-尾号6281','许昌-中原-尾号6730','阳泉-建设-尾号9026','宜昌-建设-尾号6183','榆林-中信-尾号7009','运城-工商-尾号5962','长春-建行-尾号0641','郑州-建设-尾号5173','郑州-建设-尾号6159','郑州-郑州-尾号5186','重庆-农业-尾号7248','周口-中原-尾号8641','全国通用-易宝刷卡-其它','上海-淘宝','郑州-汇付天下','郑州-工商-尾号3594','全国通用-现金','全国通用-中信卡','全国通用-农商-卓越盈佳','文盛-对公支付宝','环优盛文-客来乐-支付宝','环优-拉卡拉','环优盛文-客来乐-微信','环优-中信-尾号3814','京东-对公支付-北京','环优盛文-客来乐-支付宝','环优-拉卡拉','环优盛文-客来乐-微信','环优-中信-尾号3814','优一点-客来乐-支付宝','优一点-客来乐-微信','优一点-新大陆','优一点-民生-5150','全国通用-现金','全国通用-中信卡','全国通用-农商-卓越盈佳','全国通用-易宝刷卡-培训学校','文盛-对公支付宝','上海-淘宝','京东-对公支付-北京')
)
and fc.OrderType ='02'
and fc.CreatedOn BETWEEN  '2018-01-01 00:00:00.001' and '2020-10-31 23:59:59.999'  ;


select count( DISTINCT ogd.GradeId ) 转班 from FC_Order fc
	JOIN FC_OrderGradeDetail ogd WITH (NOLOCK)  ON ogd.OrderId = fc.OrderId
	JOIN SYS_Grade g WITH (NOLOCK)  ON g.GradeId = ogd.GradeId
where not exists (
	select 1
	from FC_Receipt r 
	join   FC_SalesChargeDetail s  on r.ReceiptGuid = s.ReceiptGuid
	join  SYS_DD dd on  s.PaymentsType = dd.DDCode and dd.DDType = 'PaymentsType'
	where r.orderId = fc.orderId
	and dd.DDName in ('安庆-农业-尾号7373','安阳-邮政-尾号1405','安阳-中信-尾号5411','保定-建设-尾号1949','保定-建设-尾号3500','北京-建设-尾号9353','常州-建设-尾号6103','成都-农业-尾号6268','福州-建设-尾号0027','福州-建设-尾号5348','福州-民生-尾号2732','工行汇款-黄森','工商银行-北京-尾号4517','工商银行-焦作-尾号4943','广州-建设-尾号8637','广州-交通-尾号6875','哈尔滨-建设-尾号2054','杭州-杭州-尾号8950','杭州-招商-尾号9653','合肥-交通-尾号5692','合肥-民生-尾号2096','菏泽-建设-尾号7999','衡阳-工商-尾号9013','济南-建设-尾号9838','济南-民生-尾号1122','济南-农行-尾号4603','济南-农业-尾号9637','济宁-中信-尾号9171','焦作-工行-尾号7987','焦作-建设-尾号0362','荆州-农商-尾号7063','开封-农信-尾号2624','六安-建设-尾号2190','洛阳-交通-尾号7925','南昌-中国-尾号6262','南京-中国-尾号8715','南京-中信-尾号6164','南阳-邮政-尾号9931','平顶山-工商-尾号0007','青岛-工行-尾号6830','青岛-工商-尾号1036','全国通用-易宝刷卡-培训学校','上海-建设-尾号9142','上海-民生-尾号4790','上海-农业-尾号1204','上海-中行-尾号1279','沈阳-建行-尾号0532','沈阳-交通-尾号2406','沈阳-盛京-尾号3390','石家庄-民生-尾号0037','石家庄-民生-尾号6129','石家庄-中信-尾号2265','石家庄-中信-尾号4151','苏州-工商-尾号0787','苏州-农行-尾号3024','苏州-农业-尾号0822','太原-民生-尾号8389','天津-中信-尾号1344','天津-中信-尾号3784','潍坊-招商-尾号8418','乌鲁木齐-中行-尾号5249','武汉-建行-尾号1275','武汉-农商-尾号0012','武汉-农业-尾号4678','武汉-兴业-尾号5712','西安-中信-尾号8691','西宁-工商-尾号3407','襄阳-中国-尾号5185','新乡-工商-尾号1324','新乡-建设-尾号6120','徐州-农业-尾号0703','许昌-建设-尾号6281','许昌-中原-尾号6730','阳泉-建设-尾号9026','宜昌-建设-尾号6183','榆林-中信-尾号7009','运城-工商-尾号5962','长春-建行-尾号0641','郑州-建设-尾号5173','郑州-建设-尾号6159','郑州-郑州-尾号5186','重庆-农业-尾号7248','周口-中原-尾号8641','全国通用-易宝刷卡-其它','上海-淘宝','郑州-汇付天下','郑州-工商-尾号3594','全国通用-现金','全国通用-中信卡','全国通用-农商-卓越盈佳','文盛-对公支付宝','环优盛文-客来乐-支付宝','环优-拉卡拉','环优盛文-客来乐-微信','环优-中信-尾号3814','京东-对公支付-北京','环优盛文-客来乐-支付宝','环优-拉卡拉','环优盛文-客来乐-微信','环优-中信-尾号3814','优一点-客来乐-支付宝','优一点-客来乐-微信','优一点-新大陆','优一点-民生-5150','全国通用-现金','全国通用-中信卡','全国通用-农商-卓越盈佳','全国通用-易宝刷卡-培训学校','文盛-对公支付宝','上海-淘宝','京东-对公支付-北京')
)
and fc.OrderType ='03'
and fc.CreatedOn BETWEEN  '2018-01-01 00:00:00.001' and '2020-10-31 23:59:59.999'  ;


select count( DISTINCT ogd.GradeId ) 退费 from FC_Order fc
	JOIN FC_OrderGradeDetail ogd WITH (NOLOCK)  ON ogd.OrderId = fc.OrderId
	JOIN SYS_Grade g WITH (NOLOCK)  ON g.GradeId = ogd.GradeId
where not exists (
	select 1
	from FC_Receipt r 
	join   FC_SalesChargeDetail s  on r.ReceiptGuid = s.ReceiptGuid
	join  SYS_DD dd on  s.PaymentsType = dd.DDCode and dd.DDType = 'PaymentsType'
	where r.orderId = fc.orderId
	and dd.DDName in ('安庆-农业-尾号7373','安阳-邮政-尾号1405','安阳-中信-尾号5411','保定-建设-尾号1949','保定-建设-尾号3500','北京-建设-尾号9353','常州-建设-尾号6103','成都-农业-尾号6268','福州-建设-尾号0027','福州-建设-尾号5348','福州-民生-尾号2732','工行汇款-黄森','工商银行-北京-尾号4517','工商银行-焦作-尾号4943','广州-建设-尾号8637','广州-交通-尾号6875','哈尔滨-建设-尾号2054','杭州-杭州-尾号8950','杭州-招商-尾号9653','合肥-交通-尾号5692','合肥-民生-尾号2096','菏泽-建设-尾号7999','衡阳-工商-尾号9013','济南-建设-尾号9838','济南-民生-尾号1122','济南-农行-尾号4603','济南-农业-尾号9637','济宁-中信-尾号9171','焦作-工行-尾号7987','焦作-建设-尾号0362','荆州-农商-尾号7063','开封-农信-尾号2624','六安-建设-尾号2190','洛阳-交通-尾号7925','南昌-中国-尾号6262','南京-中国-尾号8715','南京-中信-尾号6164','南阳-邮政-尾号9931','平顶山-工商-尾号0007','青岛-工行-尾号6830','青岛-工商-尾号1036','全国通用-易宝刷卡-培训学校','上海-建设-尾号9142','上海-民生-尾号4790','上海-农业-尾号1204','上海-中行-尾号1279','沈阳-建行-尾号0532','沈阳-交通-尾号2406','沈阳-盛京-尾号3390','石家庄-民生-尾号0037','石家庄-民生-尾号6129','石家庄-中信-尾号2265','石家庄-中信-尾号4151','苏州-工商-尾号0787','苏州-农行-尾号3024','苏州-农业-尾号0822','太原-民生-尾号8389','天津-中信-尾号1344','天津-中信-尾号3784','潍坊-招商-尾号8418','乌鲁木齐-中行-尾号5249','武汉-建行-尾号1275','武汉-农商-尾号0012','武汉-农业-尾号4678','武汉-兴业-尾号5712','西安-中信-尾号8691','西宁-工商-尾号3407','襄阳-中国-尾号5185','新乡-工商-尾号1324','新乡-建设-尾号6120','徐州-农业-尾号0703','许昌-建设-尾号6281','许昌-中原-尾号6730','阳泉-建设-尾号9026','宜昌-建设-尾号6183','榆林-中信-尾号7009','运城-工商-尾号5962','长春-建行-尾号0641','郑州-建设-尾号5173','郑州-建设-尾号6159','郑州-郑州-尾号5186','重庆-农业-尾号7248','周口-中原-尾号8641','全国通用-易宝刷卡-其它','上海-淘宝','郑州-汇付天下','郑州-工商-尾号3594','全国通用-现金','全国通用-中信卡','全国通用-农商-卓越盈佳','文盛-对公支付宝','环优盛文-客来乐-支付宝','环优-拉卡拉','环优盛文-客来乐-微信','环优-中信-尾号3814','京东-对公支付-北京','环优盛文-客来乐-支付宝','环优-拉卡拉','环优盛文-客来乐-微信','环优-中信-尾号3814','优一点-客来乐-支付宝','优一点-客来乐-微信','优一点-新大陆','优一点-民生-5150','全国通用-现金','全国通用-中信卡','全国通用-农商-卓越盈佳','全国通用-易宝刷卡-培训学校','文盛-对公支付宝','上海-淘宝','京东-对公支付-北京')
)
and fc.OrderType ='04'
and fc.CreatedOn BETWEEN  '2018-01-01 00:00:00.001' and '2020-10-31 23:59:59.999'  ;

select count( DISTINCT ogd.GradeId ) 赠课 from FC_Order fc
	JOIN FC_OrderGradeDetail ogd WITH (NOLOCK)  ON ogd.OrderId = fc.OrderId
	JOIN SYS_Grade g WITH (NOLOCK)  ON g.GradeId = ogd.GradeId
where not exists (
	select 1
	from FC_Receipt r 
	join   FC_SalesChargeDetail s  on r.ReceiptGuid = s.ReceiptGuid
	join  SYS_DD dd on  s.PaymentsType = dd.DDCode and dd.DDType = 'PaymentsType'
	where r.orderId = fc.orderId
	and dd.DDName in ('安庆-农业-尾号7373','安阳-邮政-尾号1405','安阳-中信-尾号5411','保定-建设-尾号1949','保定-建设-尾号3500','北京-建设-尾号9353','常州-建设-尾号6103','成都-农业-尾号6268','福州-建设-尾号0027','福州-建设-尾号5348','福州-民生-尾号2732','工行汇款-黄森','工商银行-北京-尾号4517','工商银行-焦作-尾号4943','广州-建设-尾号8637','广州-交通-尾号6875','哈尔滨-建设-尾号2054','杭州-杭州-尾号8950','杭州-招商-尾号9653','合肥-交通-尾号5692','合肥-民生-尾号2096','菏泽-建设-尾号7999','衡阳-工商-尾号9013','济南-建设-尾号9838','济南-民生-尾号1122','济南-农行-尾号4603','济南-农业-尾号9637','济宁-中信-尾号9171','焦作-工行-尾号7987','焦作-建设-尾号0362','荆州-农商-尾号7063','开封-农信-尾号2624','六安-建设-尾号2190','洛阳-交通-尾号7925','南昌-中国-尾号6262','南京-中国-尾号8715','南京-中信-尾号6164','南阳-邮政-尾号9931','平顶山-工商-尾号0007','青岛-工行-尾号6830','青岛-工商-尾号1036','全国通用-易宝刷卡-培训学校','上海-建设-尾号9142','上海-民生-尾号4790','上海-农业-尾号1204','上海-中行-尾号1279','沈阳-建行-尾号0532','沈阳-交通-尾号2406','沈阳-盛京-尾号3390','石家庄-民生-尾号0037','石家庄-民生-尾号6129','石家庄-中信-尾号2265','石家庄-中信-尾号4151','苏州-工商-尾号0787','苏州-农行-尾号3024','苏州-农业-尾号0822','太原-民生-尾号8389','天津-中信-尾号1344','天津-中信-尾号3784','潍坊-招商-尾号8418','乌鲁木齐-中行-尾号5249','武汉-建行-尾号1275','武汉-农商-尾号0012','武汉-农业-尾号4678','武汉-兴业-尾号5712','西安-中信-尾号8691','西宁-工商-尾号3407','襄阳-中国-尾号5185','新乡-工商-尾号1324','新乡-建设-尾号6120','徐州-农业-尾号0703','许昌-建设-尾号6281','许昌-中原-尾号6730','阳泉-建设-尾号9026','宜昌-建设-尾号6183','榆林-中信-尾号7009','运城-工商-尾号5962','长春-建行-尾号0641','郑州-建设-尾号5173','郑州-建设-尾号6159','郑州-郑州-尾号5186','重庆-农业-尾号7248','周口-中原-尾号8641','全国通用-易宝刷卡-其它','上海-淘宝','郑州-汇付天下','郑州-工商-尾号3594','全国通用-现金','全国通用-中信卡','全国通用-农商-卓越盈佳','文盛-对公支付宝','环优盛文-客来乐-支付宝','环优-拉卡拉','环优盛文-客来乐-微信','环优-中信-尾号3814','京东-对公支付-北京','环优盛文-客来乐-支付宝','环优-拉卡拉','环优盛文-客来乐-微信','环优-中信-尾号3814','优一点-客来乐-支付宝','优一点-客来乐-微信','优一点-新大陆','优一点-民生-5150','全国通用-现金','全国通用-中信卡','全国通用-农商-卓越盈佳','全国通用-易宝刷卡-培训学校','文盛-对公支付宝','上海-淘宝','京东-对公支付-北京')
)
and fc.OrderType ='05'
and fc.CreatedOn BETWEEN  '2018-01-01 00:00:00.001' and '2020-10-31 23:59:59.999'  ;





